XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/aon_reg.h
/* 0x810 : bg_sys_top */
#define AON_BG_SYS_TOP_OFFSET    (0x810)
#define AON_PU_BG_SYS_AON        AON_PU_BG_SYS_AON
#define AON_PU_BG_SYS_AON_POS    (0U)
#define AON_PU_BG_SYS_AON_LEN    (1U)
#define AON_PU_BG_SYS_AON_MSK    (((1U << AON_PU_BG_SYS_AON_LEN) - 1) << AON_PU_BG_SYS_AON_POS)
#define AON_PU_BG_SYS_AON_UMSK   (~(((1U << AON_PU_BG_SYS_AON_LEN) - 1) << AON_PU_BG_SYS_AON_POS))
#define AON_ISTART_CTRL_AON      AON_ISTART_CTRL_AON
#define AON_ISTART_CTRL_AON_POS  (1U)
#define AON_ISTART_CTRL_AON_LEN  (1U)
#define AON_ISTART_CTRL_AON_MSK  (((1U << AON_ISTART_CTRL_AON_LEN) - 1) << AON_ISTART_CTRL_AON_POS)
#define AON_ISTART_CTRL_AON_UMSK (~(((1U << AON_ISTART_CTRL_AON_LEN) - 1) << AON_ISTART_CTRL_AON_POS))

/* 0x814 : dcdc_top_0 */
#define AON_DCDC_TOP_0_OFFSET            (0x814)
#define AON_DCDC11_SSTART_TIME_AON       AON_DCDC11_SSTART_TIME_AON
#define AON_DCDC11_SSTART_TIME_AON_POS   (0U)
#define AON_DCDC11_SSTART_TIME_AON_LEN   (2U)
#define AON_DCDC11_SSTART_TIME_AON_MSK   (((1U << AON_DCDC11_SSTART_TIME_AON_LEN) - 1) << AON_DCDC11_SSTART_TIME_AON_POS)
#define AON_DCDC11_SSTART_TIME_AON_UMSK  (~(((1U << AON_DCDC11_SSTART_TIME_AON_LEN) - 1) << AON_DCDC11_SSTART_TIME_AON_POS))
#define AON_DCDC11_STBY_LP_CUR_AON       AON_DCDC11_STBY_LP_CUR_AON
#define AON_DCDC11_STBY_LP_CUR_AON_POS   (4U)
#define AON_DCDC11_STBY_LP_CUR_AON_LEN   (3U)
#define AON_DCDC11_STBY_LP_CUR_AON_MSK   (((1U << AON_DCDC11_STBY_LP_CUR_AON_LEN) - 1) << AON_DCDC11_STBY_LP_CUR_AON_POS)
#define AON_DCDC11_STBY_LP_CUR_AON_UMSK  (~(((1U << AON_DCDC11_STBY_LP_CUR_AON_LEN) - 1) << AON_DCDC11_STBY_LP_CUR_AON_POS))
#define AON_DCDC11_VC_CLAMP_VTH_AON      AON_DCDC11_VC_CLAMP_VTH_AON
#define AON_DCDC11_VC_CLAMP_VTH_AON_POS  (8U)
#define AON_DCDC11_VC_CLAMP_VTH_AON_LEN  (3U)
#define AON_DCDC11_VC_CLAMP_VTH_AON_MSK  (((1U << AON_DCDC11_VC_CLAMP_VTH_AON_LEN) - 1) << AON_DCDC11_VC_CLAMP_VTH_AON_POS)
#define AON_DCDC11_VC_CLAMP_VTH_AON_UMSK (~(((1U << AON_DCDC11_VC_CLAMP_VTH_AON_LEN) - 1) << AON_DCDC11_VC_CLAMP_VTH_AON_POS))
#define AON_DCDC11_VOUT_SEL_AON          AON_DCDC11_VOUT_SEL_AON
#define AON_DCDC11_VOUT_SEL_AON_POS      (11U)
#define AON_DCDC11_VOUT_SEL_AON_LEN      (5U)
#define AON_DCDC11_VOUT_SEL_AON_MSK      (((1U << AON_DCDC11_VOUT_SEL_AON_LEN) - 1) << AON_DCDC11_VOUT_SEL_AON_POS)
#define AON_DCDC11_VOUT_SEL_AON_UMSK     (~(((1U << AON_DCDC11_VOUT_SEL_AON_LEN) - 1) << AON_DCDC11_VOUT_SEL_AON_POS))
#define AON_DCDC11_VOUT_TRIM_AON         AON_DCDC11_VOUT_TRIM_AON
#define AON_DCDC11_VOUT_TRIM_AON_POS     (16U)
#define AON_DCDC11_VOUT_TRIM_AON_LEN     (4U)
#define AON_DCDC11_VOUT_TRIM_AON_MSK     (((1U << AON_DCDC11_VOUT_TRIM_AON_LEN) - 1) << AON_DCDC11_VOUT_TRIM_AON_POS)
#define AON_DCDC11_VOUT_TRIM_AON_UMSK    (~(((1U << AON_DCDC11_VOUT_TRIM_AON_LEN) - 1) << AON_DCDC11_VOUT_TRIM_AON_POS))
#define AON_DCDC11_VPFM_AON              AON_DCDC11_VPFM_AON
#define AON_DCDC11_VPFM_AON_POS          (20U)
#define AON_DCDC11_VPFM_AON_LEN          (4U)
#define AON_DCDC11_VPFM_AON_MSK          (((1U << AON_DCDC11_VPFM_AON_LEN) - 1) << AON_DCDC11_VPFM_AON_POS)
#define AON_DCDC11_VPFM_AON_UMSK         (~(((1U << AON_DCDC11_VPFM_AON_LEN) - 1) << AON_DCDC11_VPFM_AON_POS))
#define AON_DCDC11_ZVS_TD_OPT_AON        AON_DCDC11_ZVS_TD_OPT_AON
#define AON_DCDC11_ZVS_TD_OPT_AON_POS    (24U)
#define AON_DCDC11_ZVS_TD_OPT_AON_LEN    (3U)
#define AON_DCDC11_ZVS_TD_OPT_AON_MSK    (((1U << AON_DCDC11_ZVS_TD_OPT_AON_LEN) - 1) << AON_DCDC11_ZVS_TD_OPT_AON_POS)
#define AON_DCDC11_ZVS_TD_OPT_AON_UMSK   (~(((1U << AON_DCDC11_ZVS_TD_OPT_AON_LEN) - 1) << AON_DCDC11_ZVS_TD_OPT_AON_POS))
#define AON_DCDC11_VSTBY_AON             AON_DCDC11_VSTBY_AON
#define AON_DCDC11_VSTBY_AON_POS         (28U)
#define AON_DCDC11_VSTBY_AON_LEN         (2U)
#define AON_DCDC11_VSTBY_AON_MSK         (((1U << AON_DCDC11_VSTBY_AON_LEN) - 1) << AON_DCDC11_VSTBY_AON_POS)
#define AON_DCDC11_VSTBY_AON_UMSK        (~(((1U << AON_DCDC11_VSTBY_AON_LEN) - 1) << AON_DCDC11_VSTBY_AON_POS))

/* 0x818 : dcdc_top_1 */
#define AON_DCDC_TOP_1_OFFSET              (0x818)
#define AON_DCDC11_NONOVERLAP_TD_AON       AON_DCDC11_NONOVERLAP_TD_AON
#define AON_DCDC11_NONOVERLAP_TD_AON_POS   (0U)
#define AON_DCDC11_NONOVERLAP_TD_AON_LEN   (5U)
#define AON_DCDC11_NONOVERLAP_TD_AON_MSK   (((1U << AON_DCDC11_NONOVERLAP_TD_AON_LEN) - 1) << AON_DCDC11_NONOVERLAP_TD_AON_POS)
#define AON_DCDC11_NONOVERLAP_TD_AON_UMSK  (~(((1U << AON_DCDC11_NONOVERLAP_TD_AON_LEN) - 1) << AON_DCDC11_NONOVERLAP_TD_AON_POS))
#define AON_DCDC11_OCP_OUT_AON             AON_DCDC11_OCP_OUT_AON
#define AON_DCDC11_OCP_OUT_AON_POS         (5U)
#define AON_DCDC11_OCP_OUT_AON_LEN         (1U)
#define AON_DCDC11_OCP_OUT_AON_MSK         (((1U << AON_DCDC11_OCP_OUT_AON_LEN) - 1) << AON_DCDC11_OCP_OUT_AON_POS)
#define AON_DCDC11_OCP_OUT_AON_UMSK        (~(((1U << AON_DCDC11_OCP_OUT_AON_LEN) - 1) << AON_DCDC11_OCP_OUT_AON_POS))
#define AON_DCDC11_OCP_RST_AON             AON_DCDC11_OCP_RST_AON
#define AON_DCDC11_OCP_RST_AON_POS         (6U)
#define AON_DCDC11_OCP_RST_AON_LEN         (1U)
#define AON_DCDC11_OCP_RST_AON_MSK         (((1U << AON_DCDC11_OCP_RST_AON_LEN) - 1) << AON_DCDC11_OCP_RST_AON_POS)
#define AON_DCDC11_OCP_RST_AON_UMSK        (~(((1U << AON_DCDC11_OCP_RST_AON_LEN) - 1) << AON_DCDC11_OCP_RST_AON_POS))
#define AON_DCDC11_OCP_VTH_AON             AON_DCDC11_OCP_VTH_AON
#define AON_DCDC11_OCP_VTH_AON_POS         (8U)
#define AON_DCDC11_OCP_VTH_AON_LEN         (3U)
#define AON_DCDC11_OCP_VTH_AON_MSK         (((1U << AON_DCDC11_OCP_VTH_AON_LEN) - 1) << AON_DCDC11_OCP_VTH_AON_POS)
#define AON_DCDC11_OCP_VTH_AON_UMSK        (~(((1U << AON_DCDC11_OCP_VTH_AON_LEN) - 1) << AON_DCDC11_OCP_VTH_AON_POS))
#define AON_DCDC11_OSC_2M_MODE_AON         AON_DCDC11_OSC_2M_MODE_AON
#define AON_DCDC11_OSC_2M_MODE_AON_POS     (11U)
#define AON_DCDC11_OSC_2M_MODE_AON_LEN     (1U)
#define AON_DCDC11_OSC_2M_MODE_AON_MSK     (((1U << AON_DCDC11_OSC_2M_MODE_AON_LEN) - 1) << AON_DCDC11_OSC_2M_MODE_AON_POS)
#define AON_DCDC11_OSC_2M_MODE_AON_UMSK    (~(((1U << AON_DCDC11_OSC_2M_MODE_AON_LEN) - 1) << AON_DCDC11_OSC_2M_MODE_AON_POS))
#define AON_DCDC11_OSC_FREQ_TRIM_AON       AON_DCDC11_OSC_FREQ_TRIM_AON
#define AON_DCDC11_OSC_FREQ_TRIM_AON_POS   (12U)
#define AON_DCDC11_OSC_FREQ_TRIM_AON_LEN   (4U)
#define AON_DCDC11_OSC_FREQ_TRIM_AON_MSK   (((1U << AON_DCDC11_OSC_FREQ_TRIM_AON_LEN) - 1) << AON_DCDC11_OSC_FREQ_TRIM_AON_POS)
#define AON_DCDC11_OSC_FREQ_TRIM_AON_UMSK  (~(((1U << AON_DCDC11_OSC_FREQ_TRIM_AON_LEN) - 1) << AON_DCDC11_OSC_FREQ_TRIM_AON_POS))
#define AON_DCDC11_PULLDOWN_AON            AON_DCDC11_PULLDOWN_AON
#define AON_DCDC11_PULLDOWN_AON_POS        (16U)
#define AON_DCDC11_PULLDOWN_AON_LEN        (1U)
#define AON_DCDC11_PULLDOWN_AON_MSK        (((1U << AON_DCDC11_PULLDOWN_AON_LEN) - 1) << AON_DCDC11_PULLDOWN_AON_POS)
#define AON_DCDC11_PULLDOWN_AON_UMSK       (~(((1U << AON_DCDC11_PULLDOWN_AON_LEN) - 1) << AON_DCDC11_PULLDOWN_AON_POS))
#define AON_DCDC11_RC_SEL_AON              AON_DCDC11_RC_SEL_AON
#define AON_DCDC11_RC_SEL_AON_POS          (20U)
#define AON_DCDC11_RC_SEL_AON_LEN          (4U)
#define AON_DCDC11_RC_SEL_AON_MSK          (((1U << AON_DCDC11_RC_SEL_AON_LEN) - 1) << AON_DCDC11_RC_SEL_AON_POS)
#define AON_DCDC11_RC_SEL_AON_UMSK         (~(((1U << AON_DCDC11_RC_SEL_AON_LEN) - 1) << AON_DCDC11_RC_SEL_AON_POS))
#define AON_DCDC11_RDY_AON                 AON_DCDC11_RDY_AON
#define AON_DCDC11_RDY_AON_POS             (24U)
#define AON_DCDC11_RDY_AON_LEN             (1U)
#define AON_DCDC11_RDY_AON_MSK             (((1U << AON_DCDC11_RDY_AON_LEN) - 1) << AON_DCDC11_RDY_AON_POS)
#define AON_DCDC11_RDY_AON_UMSK            (~(((1U << AON_DCDC11_RDY_AON_LEN) - 1) << AON_DCDC11_RDY_AON_POS))
#define AON_DCDC11_SLOPE_CURR_SEL_AON      AON_DCDC11_SLOPE_CURR_SEL_AON
#define AON_DCDC11_SLOPE_CURR_SEL_AON_POS  (26U)
#define AON_DCDC11_SLOPE_CURR_SEL_AON_LEN  (5U)
#define AON_DCDC11_SLOPE_CURR_SEL_AON_MSK  (((1U << AON_DCDC11_SLOPE_CURR_SEL_AON_LEN) - 1) << AON_DCDC11_SLOPE_CURR_SEL_AON_POS)
#define AON_DCDC11_SLOPE_CURR_SEL_AON_UMSK (~(((1U << AON_DCDC11_SLOPE_CURR_SEL_AON_LEN) - 1) << AON_DCDC11_SLOPE_CURR_SEL_AON_POS))

