XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/aon_reg.h
/* 0x81C : ldo11soc_and_dctest */
#define AON_LDO11SOC_AND_DCTEST_OFFSET        (0x81C)
#define AON_DCDC11_CFB_SEL_AON                AON_DCDC11_CFB_SEL_AON
#define AON_DCDC11_CFB_SEL_AON_POS            (4U)
#define AON_DCDC11_CFB_SEL_AON_LEN            (4U)
#define AON_DCDC11_CFB_SEL_AON_MSK            (((1U << AON_DCDC11_CFB_SEL_AON_LEN) - 1) << AON_DCDC11_CFB_SEL_AON_POS)
#define AON_DCDC11_CFB_SEL_AON_UMSK           (~(((1U << AON_DCDC11_CFB_SEL_AON_LEN) - 1) << AON_DCDC11_CFB_SEL_AON_POS))
#define AON_DCDC11_CHF_SEL_AON                AON_DCDC11_CHF_SEL_AON
#define AON_DCDC11_CHF_SEL_AON_POS            (8U)
#define AON_DCDC11_CHF_SEL_AON_LEN            (4U)
#define AON_DCDC11_CHF_SEL_AON_MSK            (((1U << AON_DCDC11_CHF_SEL_AON_LEN) - 1) << AON_DCDC11_CHF_SEL_AON_POS)
#define AON_DCDC11_CHF_SEL_AON_UMSK           (~(((1U << AON_DCDC11_CHF_SEL_AON_LEN) - 1) << AON_DCDC11_CHF_SEL_AON_POS))
#define AON_DCDC11_COMP_GM_SEL_AON            AON_DCDC11_COMP_GM_SEL_AON
#define AON_DCDC11_COMP_GM_SEL_AON_POS        (12U)
#define AON_DCDC11_COMP_GM_SEL_AON_LEN        (3U)
#define AON_DCDC11_COMP_GM_SEL_AON_MSK        (((1U << AON_DCDC11_COMP_GM_SEL_AON_LEN) - 1) << AON_DCDC11_COMP_GM_SEL_AON_POS)
#define AON_DCDC11_COMP_GM_SEL_AON_UMSK       (~(((1U << AON_DCDC11_COMP_GM_SEL_AON_LEN) - 1) << AON_DCDC11_COMP_GM_SEL_AON_POS))
#define AON_DCDC11_CS_DELAY_AON               AON_DCDC11_CS_DELAY_AON
#define AON_DCDC11_CS_DELAY_AON_POS           (16U)
#define AON_DCDC11_CS_DELAY_AON_LEN           (3U)
#define AON_DCDC11_CS_DELAY_AON_MSK           (((1U << AON_DCDC11_CS_DELAY_AON_LEN) - 1) << AON_DCDC11_CS_DELAY_AON_POS)
#define AON_DCDC11_CS_DELAY_AON_UMSK          (~(((1U << AON_DCDC11_CS_DELAY_AON_LEN) - 1) << AON_DCDC11_CS_DELAY_AON_POS))
#define AON_DCDC11_DRV_SR_AON                 AON_DCDC11_DRV_SR_AON
#define AON_DCDC11_DRV_SR_AON_POS             (20U)
#define AON_DCDC11_DRV_SR_AON_LEN             (2U)
#define AON_DCDC11_DRV_SR_AON_MSK             (((1U << AON_DCDC11_DRV_SR_AON_LEN) - 1) << AON_DCDC11_DRV_SR_AON_POS)
#define AON_DCDC11_DRV_SR_AON_UMSK            (~(((1U << AON_DCDC11_DRV_SR_AON_LEN) - 1) << AON_DCDC11_DRV_SR_AON_POS))
#define AON_DCDC11_EN_ANTIRING_AON            AON_DCDC11_EN_ANTIRING_AON
#define AON_DCDC11_EN_ANTIRING_AON_POS        (22U)
#define AON_DCDC11_EN_ANTIRING_AON_LEN        (1U)
#define AON_DCDC11_EN_ANTIRING_AON_MSK        (((1U << AON_DCDC11_EN_ANTIRING_AON_LEN) - 1) << AON_DCDC11_EN_ANTIRING_AON_POS)
#define AON_DCDC11_EN_ANTIRING_AON_UMSK       (~(((1U << AON_DCDC11_EN_ANTIRING_AON_LEN) - 1) << AON_DCDC11_EN_ANTIRING_AON_POS))
#define AON_DCDC11_EN_OSC_INHIBIT_T2_AON      AON_DCDC11_EN_OSC_INHIBIT_T2_AON
#define AON_DCDC11_EN_OSC_INHIBIT_T2_AON_POS  (23U)
#define AON_DCDC11_EN_OSC_INHIBIT_T2_AON_LEN  (1U)
#define AON_DCDC11_EN_OSC_INHIBIT_T2_AON_MSK  (((1U << AON_DCDC11_EN_OSC_INHIBIT_T2_AON_LEN) - 1) << AON_DCDC11_EN_OSC_INHIBIT_T2_AON_POS)
#define AON_DCDC11_EN_OSC_INHIBIT_T2_AON_UMSK (~(((1U << AON_DCDC11_EN_OSC_INHIBIT_T2_AON_LEN) - 1) << AON_DCDC11_EN_OSC_INHIBIT_T2_AON_POS))
#define AON_DCDC11_EN_SLOW_OSC_AON            AON_DCDC11_EN_SLOW_OSC_AON
#define AON_DCDC11_EN_SLOW_OSC_AON_POS        (24U)
#define AON_DCDC11_EN_SLOW_OSC_AON_LEN        (1U)
#define AON_DCDC11_EN_SLOW_OSC_AON_MSK        (((1U << AON_DCDC11_EN_SLOW_OSC_AON_LEN) - 1) << AON_DCDC11_EN_SLOW_OSC_AON_POS)
#define AON_DCDC11_EN_SLOW_OSC_AON_UMSK       (~(((1U << AON_DCDC11_EN_SLOW_OSC_AON_LEN) - 1) << AON_DCDC11_EN_SLOW_OSC_AON_POS))
#define AON_DCDC11_EN_STBY_LP_AON             AON_DCDC11_EN_STBY_LP_AON
#define AON_DCDC11_EN_STBY_LP_AON_POS         (25U)
#define AON_DCDC11_EN_STBY_LP_AON_LEN         (1U)
#define AON_DCDC11_EN_STBY_LP_AON_MSK         (((1U << AON_DCDC11_EN_STBY_LP_AON_LEN) - 1) << AON_DCDC11_EN_STBY_LP_AON_POS)
#define AON_DCDC11_EN_STBY_LP_AON_UMSK        (~(((1U << AON_DCDC11_EN_STBY_LP_AON_LEN) - 1) << AON_DCDC11_EN_STBY_LP_AON_POS))
#define AON_DCDC11_EN_STOP_OSC_AON            AON_DCDC11_EN_STOP_OSC_AON
#define AON_DCDC11_EN_STOP_OSC_AON_POS        (26U)
#define AON_DCDC11_EN_STOP_OSC_AON_LEN        (1U)
#define AON_DCDC11_EN_STOP_OSC_AON_MSK        (((1U << AON_DCDC11_EN_STOP_OSC_AON_LEN) - 1) << AON_DCDC11_EN_STOP_OSC_AON_POS)
#define AON_DCDC11_EN_STOP_OSC_AON_UMSK       (~(((1U << AON_DCDC11_EN_STOP_OSC_AON_LEN) - 1) << AON_DCDC11_EN_STOP_OSC_AON_POS))
#define AON_DCDC11_FORCE_EN_CS_ZVS_AON        AON_DCDC11_FORCE_EN_CS_ZVS_AON
#define AON_DCDC11_FORCE_EN_CS_ZVS_AON_POS    (27U)
#define AON_DCDC11_FORCE_EN_CS_ZVS_AON_LEN    (1U)
#define AON_DCDC11_FORCE_EN_CS_ZVS_AON_MSK    (((1U << AON_DCDC11_FORCE_EN_CS_ZVS_AON_LEN) - 1) << AON_DCDC11_FORCE_EN_CS_ZVS_AON_POS)
#define AON_DCDC11_FORCE_EN_CS_ZVS_AON_UMSK   (~(((1U << AON_DCDC11_FORCE_EN_CS_ZVS_AON_LEN) - 1) << AON_DCDC11_FORCE_EN_CS_ZVS_AON_POS))
#define AON_DCDC11_ISENSE_TRIM_AON            AON_DCDC11_ISENSE_TRIM_AON
#define AON_DCDC11_ISENSE_TRIM_AON_POS        (28U)
#define AON_DCDC11_ISENSE_TRIM_AON_LEN        (3U)
#define AON_DCDC11_ISENSE_TRIM_AON_MSK        (((1U << AON_DCDC11_ISENSE_TRIM_AON_LEN) - 1) << AON_DCDC11_ISENSE_TRIM_AON_POS)
#define AON_DCDC11_ISENSE_TRIM_AON_UMSK       (~(((1U << AON_DCDC11_ISENSE_TRIM_AON_LEN) - 1) << AON_DCDC11_ISENSE_TRIM_AON_POS))

/* 0x820 : move to 0x2000F000[23] */
#define AON_DCDC18_TOP_0_OFFSET          (0x820)
#define AON_DCDC18_SSTART_TIME_AON       AON_DCDC18_SSTART_TIME_AON
#define AON_DCDC18_SSTART_TIME_AON_POS   (0U)
#define AON_DCDC18_SSTART_TIME_AON_LEN   (2U)
#define AON_DCDC18_SSTART_TIME_AON_MSK   (((1U << AON_DCDC18_SSTART_TIME_AON_LEN) - 1) << AON_DCDC18_SSTART_TIME_AON_POS)
#define AON_DCDC18_SSTART_TIME_AON_UMSK  (~(((1U << AON_DCDC18_SSTART_TIME_AON_LEN) - 1) << AON_DCDC18_SSTART_TIME_AON_POS))
#define AON_DCDC18_STBY_LP_CUR_AON       AON_DCDC18_STBY_LP_CUR_AON
#define AON_DCDC18_STBY_LP_CUR_AON_POS   (4U)
#define AON_DCDC18_STBY_LP_CUR_AON_LEN   (3U)
#define AON_DCDC18_STBY_LP_CUR_AON_MSK   (((1U << AON_DCDC18_STBY_LP_CUR_AON_LEN) - 1) << AON_DCDC18_STBY_LP_CUR_AON_POS)
#define AON_DCDC18_STBY_LP_CUR_AON_UMSK  (~(((1U << AON_DCDC18_STBY_LP_CUR_AON_LEN) - 1) << AON_DCDC18_STBY_LP_CUR_AON_POS))
#define AON_DCDC18_VC_CLAMP_VTH_AON      AON_DCDC18_VC_CLAMP_VTH_AON
#define AON_DCDC18_VC_CLAMP_VTH_AON_POS  (8U)
#define AON_DCDC18_VC_CLAMP_VTH_AON_LEN  (3U)
#define AON_DCDC18_VC_CLAMP_VTH_AON_MSK  (((1U << AON_DCDC18_VC_CLAMP_VTH_AON_LEN) - 1) << AON_DCDC18_VC_CLAMP_VTH_AON_POS)
#define AON_DCDC18_VC_CLAMP_VTH_AON_UMSK (~(((1U << AON_DCDC18_VC_CLAMP_VTH_AON_LEN) - 1) << AON_DCDC18_VC_CLAMP_VTH_AON_POS))
#define AON_DCDC18_VOUT_SEL_AON          AON_DCDC18_VOUT_SEL_AON
#define AON_DCDC18_VOUT_SEL_AON_POS      (11U)
#define AON_DCDC18_VOUT_SEL_AON_LEN      (5U)
#define AON_DCDC18_VOUT_SEL_AON_MSK      (((1U << AON_DCDC18_VOUT_SEL_AON_LEN) - 1) << AON_DCDC18_VOUT_SEL_AON_POS)
#define AON_DCDC18_VOUT_SEL_AON_UMSK     (~(((1U << AON_DCDC18_VOUT_SEL_AON_LEN) - 1) << AON_DCDC18_VOUT_SEL_AON_POS))
#define AON_DCDC18_VOUT_TRIM_AON         AON_DCDC18_VOUT_TRIM_AON
#define AON_DCDC18_VOUT_TRIM_AON_POS     (16U)
#define AON_DCDC18_VOUT_TRIM_AON_LEN     (4U)
#define AON_DCDC18_VOUT_TRIM_AON_MSK     (((1U << AON_DCDC18_VOUT_TRIM_AON_LEN) - 1) << AON_DCDC18_VOUT_TRIM_AON_POS)
#define AON_DCDC18_VOUT_TRIM_AON_UMSK    (~(((1U << AON_DCDC18_VOUT_TRIM_AON_LEN) - 1) << AON_DCDC18_VOUT_TRIM_AON_POS))
#define AON_DCDC18_VPFM_AON              AON_DCDC18_VPFM_AON
#define AON_DCDC18_VPFM_AON_POS          (20U)
#define AON_DCDC18_VPFM_AON_LEN          (4U)
#define AON_DCDC18_VPFM_AON_MSK          (((1U << AON_DCDC18_VPFM_AON_LEN) - 1) << AON_DCDC18_VPFM_AON_POS)
#define AON_DCDC18_VPFM_AON_UMSK         (~(((1U << AON_DCDC18_VPFM_AON_LEN) - 1) << AON_DCDC18_VPFM_AON_POS))
#define AON_DCDC18_ZVS_TD_OPT_AON        AON_DCDC18_ZVS_TD_OPT_AON
#define AON_DCDC18_ZVS_TD_OPT_AON_POS    (24U)
#define AON_DCDC18_ZVS_TD_OPT_AON_LEN    (3U)
#define AON_DCDC18_ZVS_TD_OPT_AON_MSK    (((1U << AON_DCDC18_ZVS_TD_OPT_AON_LEN) - 1) << AON_DCDC18_ZVS_TD_OPT_AON_POS)
#define AON_DCDC18_ZVS_TD_OPT_AON_UMSK   (~(((1U << AON_DCDC18_ZVS_TD_OPT_AON_LEN) - 1) << AON_DCDC18_ZVS_TD_OPT_AON_POS))
#define AON_DCDC18_VSTBY_AON             AON_DCDC18_VSTBY_AON
#define AON_DCDC18_VSTBY_AON_POS         (28U)
#define AON_DCDC18_VSTBY_AON_LEN         (2U)
#define AON_DCDC18_VSTBY_AON_MSK         (((1U << AON_DCDC18_VSTBY_AON_LEN) - 1) << AON_DCDC18_VSTBY_AON_POS)
#define AON_DCDC18_VSTBY_AON_UMSK        (~(((1U << AON_DCDC18_VSTBY_AON_LEN) - 1) << AON_DCDC18_VSTBY_AON_POS))

/* 0x824 : dcdc18_top_1 */
#define AON_DCDC18_TOP_1_OFFSET            (0x824)
#define AON_DCDC18_NONOVERLAP_TD_AON       AON_DCDC18_NONOVERLAP_TD_AON
#define AON_DCDC18_NONOVERLAP_TD_AON_POS   (0U)
#define AON_DCDC18_NONOVERLAP_TD_AON_LEN   (5U)
#define AON_DCDC18_NONOVERLAP_TD_AON_MSK   (((1U << AON_DCDC18_NONOVERLAP_TD_AON_LEN) - 1) << AON_DCDC18_NONOVERLAP_TD_AON_POS)
#define AON_DCDC18_NONOVERLAP_TD_AON_UMSK  (~(((1U << AON_DCDC18_NONOVERLAP_TD_AON_LEN) - 1) << AON_DCDC18_NONOVERLAP_TD_AON_POS))
#define AON_DCDC18_OCP_OUT_AON             AON_DCDC18_OCP_OUT_AON
#define AON_DCDC18_OCP_OUT_AON_POS         (5U)
#define AON_DCDC18_OCP_OUT_AON_LEN         (1U)
#define AON_DCDC18_OCP_OUT_AON_MSK         (((1U << AON_DCDC18_OCP_OUT_AON_LEN) - 1) << AON_DCDC18_OCP_OUT_AON_POS)
#define AON_DCDC18_OCP_OUT_AON_UMSK        (~(((1U << AON_DCDC18_OCP_OUT_AON_LEN) - 1) << AON_DCDC18_OCP_OUT_AON_POS))
#define AON_DCDC18_OCP_RST_AON             AON_DCDC18_OCP_RST_AON
#define AON_DCDC18_OCP_RST_AON_POS         (6U)
#define AON_DCDC18_OCP_RST_AON_LEN         (1U)
#define AON_DCDC18_OCP_RST_AON_MSK         (((1U << AON_DCDC18_OCP_RST_AON_LEN) - 1) << AON_DCDC18_OCP_RST_AON_POS)
#define AON_DCDC18_OCP_RST_AON_UMSK        (~(((1U << AON_DCDC18_OCP_RST_AON_LEN) - 1) << AON_DCDC18_OCP_RST_AON_POS))
#define AON_DCDC18_OCP_VTH_AON             AON_DCDC18_OCP_VTH_AON
#define AON_DCDC18_OCP_VTH_AON_POS         (8U)
#define AON_DCDC18_OCP_VTH_AON_LEN         (3U)
#define AON_DCDC18_OCP_VTH_AON_MSK         (((1U << AON_DCDC18_OCP_VTH_AON_LEN) - 1) << AON_DCDC18_OCP_VTH_AON_POS)
#define AON_DCDC18_OCP_VTH_AON_UMSK        (~(((1U << AON_DCDC18_OCP_VTH_AON_LEN) - 1) << AON_DCDC18_OCP_VTH_AON_POS))
#define AON_DCDC18_OSC_2M_MODE_AON         AON_DCDC18_OSC_2M_MODE_AON
#define AON_DCDC18_OSC_2M_MODE_AON_POS     (11U)
#define AON_DCDC18_OSC_2M_MODE_AON_LEN     (1U)
#define AON_DCDC18_OSC_2M_MODE_AON_MSK     (((1U << AON_DCDC18_OSC_2M_MODE_AON_LEN) - 1) << AON_DCDC18_OSC_2M_MODE_AON_POS)
#define AON_DCDC18_OSC_2M_MODE_AON_UMSK    (~(((1U << AON_DCDC18_OSC_2M_MODE_AON_LEN) - 1) << AON_DCDC18_OSC_2M_MODE_AON_POS))
#define AON_DCDC18_OSC_FREQ_TRIM_AON       AON_DCDC18_OSC_FREQ_TRIM_AON
#define AON_DCDC18_OSC_FREQ_TRIM_AON_POS   (12U)
#define AON_DCDC18_OSC_FREQ_TRIM_AON_LEN   (4U)
#define AON_DCDC18_OSC_FREQ_TRIM_AON_MSK   (((1U << AON_DCDC18_OSC_FREQ_TRIM_AON_LEN) - 1) << AON_DCDC18_OSC_FREQ_TRIM_AON_POS)
#define AON_DCDC18_OSC_FREQ_TRIM_AON_UMSK  (~(((1U << AON_DCDC18_OSC_FREQ_TRIM_AON_LEN) - 1) << AON_DCDC18_OSC_FREQ_TRIM_AON_POS))
#define AON_DCDC18_PULLDOWN_AON            AON_DCDC18_PULLDOWN_AON
#define AON_DCDC18_PULLDOWN_AON_POS        (16U)
#define AON_DCDC18_PULLDOWN_AON_LEN        (1U)
#define AON_DCDC18_PULLDOWN_AON_MSK        (((1U << AON_DCDC18_PULLDOWN_AON_LEN) - 1) << AON_DCDC18_PULLDOWN_AON_POS)
#define AON_DCDC18_PULLDOWN_AON_UMSK       (~(((1U << AON_DCDC18_PULLDOWN_AON_LEN) - 1) << AON_DCDC18_PULLDOWN_AON_POS))
#define AON_DCDC18_RC_SEL_AON              AON_DCDC18_RC_SEL_AON
#define AON_DCDC18_RC_SEL_AON_POS          (20U)
#define AON_DCDC18_RC_SEL_AON_LEN          (4U)
#define AON_DCDC18_RC_SEL_AON_MSK          (((1U << AON_DCDC18_RC_SEL_AON_LEN) - 1) << AON_DCDC18_RC_SEL_AON_POS)
#define AON_DCDC18_RC_SEL_AON_UMSK         (~(((1U << AON_DCDC18_RC_SEL_AON_LEN) - 1) << AON_DCDC18_RC_SEL_AON_POS))
#define AON_DCDC18_RDY_AON                 AON_DCDC18_RDY_AON
#define AON_DCDC18_RDY_AON_POS             (24U)
#define AON_DCDC18_RDY_AON_LEN             (1U)
#define AON_DCDC18_RDY_AON_MSK             (((1U << AON_DCDC18_RDY_AON_LEN) - 1) << AON_DCDC18_RDY_AON_POS)
#define AON_DCDC18_RDY_AON_UMSK            (~(((1U << AON_DCDC18_RDY_AON_LEN) - 1) << AON_DCDC18_RDY_AON_POS))
#define AON_DCDC18_SLOPE_CURR_SEL_AON      AON_DCDC18_SLOPE_CURR_SEL_AON
#define AON_DCDC18_SLOPE_CURR_SEL_AON_POS  (26U)
#define AON_DCDC18_SLOPE_CURR_SEL_AON_LEN  (5U)
#define AON_DCDC18_SLOPE_CURR_SEL_AON_MSK  (((1U << AON_DCDC18_SLOPE_CURR_SEL_AON_LEN) - 1) << AON_DCDC18_SLOPE_CURR_SEL_AON_POS)
#define AON_DCDC18_SLOPE_CURR_SEL_AON_UMSK (~(((1U << AON_DCDC18_SLOPE_CURR_SEL_AON_LEN) - 1) << AON_DCDC18_SLOPE_CURR_SEL_AON_POS))

/* 0x828 : dcdc18_top_2 */
#define AON_DCDC18_TOP_2_OFFSET               (0x828)
#define AON_DCDC18_CFB_SEL_AON                AON_DCDC18_CFB_SEL_AON
#define AON_DCDC18_CFB_SEL_AON_POS            (4U)
#define AON_DCDC18_CFB_SEL_AON_LEN            (4U)
#define AON_DCDC18_CFB_SEL_AON_MSK            (((1U << AON_DCDC18_CFB_SEL_AON_LEN) - 1) << AON_DCDC18_CFB_SEL_AON_POS)
#define AON_DCDC18_CFB_SEL_AON_UMSK           (~(((1U << AON_DCDC18_CFB_SEL_AON_LEN) - 1) << AON_DCDC18_CFB_SEL_AON_POS))
#define AON_DCDC18_CHF_SEL_AON                AON_DCDC18_CHF_SEL_AON
#define AON_DCDC18_CHF_SEL_AON_POS            (8U)
#define AON_DCDC18_CHF_SEL_AON_LEN            (4U)
#define AON_DCDC18_CHF_SEL_AON_MSK            (((1U << AON_DCDC18_CHF_SEL_AON_LEN) - 1) << AON_DCDC18_CHF_SEL_AON_POS)
#define AON_DCDC18_CHF_SEL_AON_UMSK           (~(((1U << AON_DCDC18_CHF_SEL_AON_LEN) - 1) << AON_DCDC18_CHF_SEL_AON_POS))
#define AON_DCDC18_COMP_GM_SEL_AON            AON_DCDC18_COMP_GM_SEL_AON
#define AON_DCDC18_COMP_GM_SEL_AON_POS        (12U)
#define AON_DCDC18_COMP_GM_SEL_AON_LEN        (3U)
#define AON_DCDC18_COMP_GM_SEL_AON_MSK        (((1U << AON_DCDC18_COMP_GM_SEL_AON_LEN) - 1) << AON_DCDC18_COMP_GM_SEL_AON_POS)
#define AON_DCDC18_COMP_GM_SEL_AON_UMSK       (~(((1U << AON_DCDC18_COMP_GM_SEL_AON_LEN) - 1) << AON_DCDC18_COMP_GM_SEL_AON_POS))
#define AON_DCDC18_CS_DELAY_AON               AON_DCDC18_CS_DELAY_AON
#define AON_DCDC18_CS_DELAY_AON_POS           (16U)
#define AON_DCDC18_CS_DELAY_AON_LEN           (3U)
#define AON_DCDC18_CS_DELAY_AON_MSK           (((1U << AON_DCDC18_CS_DELAY_AON_LEN) - 1) << AON_DCDC18_CS_DELAY_AON_POS)
#define AON_DCDC18_CS_DELAY_AON_UMSK          (~(((1U << AON_DCDC18_CS_DELAY_AON_LEN) - 1) << AON_DCDC18_CS_DELAY_AON_POS))
#define AON_DCDC18_DRV_SR_AON                 AON_DCDC18_DRV_SR_AON
#define AON_DCDC18_DRV_SR_AON_POS             (20U)
#define AON_DCDC18_DRV_SR_AON_LEN             (2U)
#define AON_DCDC18_DRV_SR_AON_MSK             (((1U << AON_DCDC18_DRV_SR_AON_LEN) - 1) << AON_DCDC18_DRV_SR_AON_POS)
#define AON_DCDC18_DRV_SR_AON_UMSK            (~(((1U << AON_DCDC18_DRV_SR_AON_LEN) - 1) << AON_DCDC18_DRV_SR_AON_POS))
#define AON_DCDC18_EN_ANTIRING_AON            AON_DCDC18_EN_ANTIRING_AON
#define AON_DCDC18_EN_ANTIRING_AON_POS        (22U)
#define AON_DCDC18_EN_ANTIRING_AON_LEN        (1U)
#define AON_DCDC18_EN_ANTIRING_AON_MSK        (((1U << AON_DCDC18_EN_ANTIRING_AON_LEN) - 1) << AON_DCDC18_EN_ANTIRING_AON_POS)
#define AON_DCDC18_EN_ANTIRING_AON_UMSK       (~(((1U << AON_DCDC18_EN_ANTIRING_AON_LEN) - 1) << AON_DCDC18_EN_ANTIRING_AON_POS))
#define AON_DCDC18_EN_OSC_INHIBIT_T2_AON      AON_DCDC18_EN_OSC_INHIBIT_T2_AON
#define AON_DCDC18_EN_OSC_INHIBIT_T2_AON_POS  (23U)
#define AON_DCDC18_EN_OSC_INHIBIT_T2_AON_LEN  (1U)
#define AON_DCDC18_EN_OSC_INHIBIT_T2_AON_MSK  (((1U << AON_DCDC18_EN_OSC_INHIBIT_T2_AON_LEN) - 1) << AON_DCDC18_EN_OSC_INHIBIT_T2_AON_POS)
#define AON_DCDC18_EN_OSC_INHIBIT_T2_AON_UMSK (~(((1U << AON_DCDC18_EN_OSC_INHIBIT_T2_AON_LEN) - 1) << AON_DCDC18_EN_OSC_INHIBIT_T2_AON_POS))
#define AON_DCDC18_EN_SLOW_OSC_AON            AON_DCDC18_EN_SLOW_OSC_AON
#define AON_DCDC18_EN_SLOW_OSC_AON_POS        (24U)
#define AON_DCDC18_EN_SLOW_OSC_AON_LEN        (1U)
#define AON_DCDC18_EN_SLOW_OSC_AON_MSK        (((1U << AON_DCDC18_EN_SLOW_OSC_AON_LEN) - 1) << AON_DCDC18_EN_SLOW_OSC_AON_POS)
#define AON_DCDC18_EN_SLOW_OSC_AON_UMSK       (~(((1U << AON_DCDC18_EN_SLOW_OSC_AON_LEN) - 1) << AON_DCDC18_EN_SLOW_OSC_AON_POS))
#define AON_DCDC18_EN_STBY_LP_AON             AON_DCDC18_EN_STBY_LP_AON
#define AON_DCDC18_EN_STBY_LP_AON_POS         (25U)
#define AON_DCDC18_EN_STBY_LP_AON_LEN         (1U)
#define AON_DCDC18_EN_STBY_LP_AON_MSK         (((1U << AON_DCDC18_EN_STBY_LP_AON_LEN) - 1) << AON_DCDC18_EN_STBY_LP_AON_POS)
#define AON_DCDC18_EN_STBY_LP_AON_UMSK        (~(((1U << AON_DCDC18_EN_STBY_LP_AON_LEN) - 1) << AON_DCDC18_EN_STBY_LP_AON_POS))
#define AON_DCDC18_EN_STOP_OSC_AON            AON_DCDC18_EN_STOP_OSC_AON
#define AON_DCDC18_EN_STOP_OSC_AON_POS        (26U)
#define AON_DCDC18_EN_STOP_OSC_AON_LEN        (1U)
#define AON_DCDC18_EN_STOP_OSC_AON_MSK        (((1U << AON_DCDC18_EN_STOP_OSC_AON_LEN) - 1) << AON_DCDC18_EN_STOP_OSC_AON_POS)
#define AON_DCDC18_EN_STOP_OSC_AON_UMSK       (~(((1U << AON_DCDC18_EN_STOP_OSC_AON_LEN) - 1) << AON_DCDC18_EN_STOP_OSC_AON_POS))
#define AON_DCDC18_FORCE_EN_CS_ZVS_AON        AON_DCDC18_FORCE_EN_CS_ZVS_AON
#define AON_DCDC18_FORCE_EN_CS_ZVS_AON_POS    (27U)
#define AON_DCDC18_FORCE_EN_CS_ZVS_AON_LEN    (1U)
#define AON_DCDC18_FORCE_EN_CS_ZVS_AON_MSK    (((1U << AON_DCDC18_FORCE_EN_CS_ZVS_AON_LEN) - 1) << AON_DCDC18_FORCE_EN_CS_ZVS_AON_POS)
#define AON_DCDC18_FORCE_EN_CS_ZVS_AON_UMSK   (~(((1U << AON_DCDC18_FORCE_EN_CS_ZVS_AON_LEN) - 1) << AON_DCDC18_FORCE_EN_CS_ZVS_AON_POS))
#define AON_DCDC18_ISENSE_TRIM_AON            AON_DCDC18_ISENSE_TRIM_AON
#define AON_DCDC18_ISENSE_TRIM_AON_POS        (28U)
#define AON_DCDC18_ISENSE_TRIM_AON_LEN        (3U)
#define AON_DCDC18_ISENSE_TRIM_AON_MSK        (((1U << AON_DCDC18_ISENSE_TRIM_AON_LEN) - 1) << AON_DCDC18_ISENSE_TRIM_AON_POS)
#define AON_DCDC18_ISENSE_TRIM_AON_UMSK       (~(((1U << AON_DCDC18_ISENSE_TRIM_AON_LEN) - 1) << AON_DCDC18_ISENSE_TRIM_AON_POS))

/* 0x82C : psw_irrcv */
#define AON_PSW_IRRCV_OFFSET           (0x82C)
#define AON_PU_PSW_IRRCV_AON           AON_PU_PSW_IRRCV_AON
#define AON_PU_PSW_IRRCV_AON_POS       (0U)
#define AON_PU_PSW_IRRCV_AON_LEN       (1U)
#define AON_PU_PSW_IRRCV_AON_MSK       (((1U << AON_PU_PSW_IRRCV_AON_LEN) - 1) << AON_PU_PSW_IRRCV_AON_POS)
#define AON_PU_PSW_IRRCV_AON_UMSK      (~(((1U << AON_PU_PSW_IRRCV_AON_LEN) - 1) << AON_PU_PSW_IRRCV_AON_POS))
#define AON_USB20_RREF_EXT_EN_AON      AON_USB20_RREF_EXT_EN_AON
#define AON_USB20_RREF_EXT_EN_AON_POS  (19U)
#define AON_USB20_RREF_EXT_EN_AON_LEN  (1U)
#define AON_USB20_RREF_EXT_EN_AON_MSK  (((1U << AON_USB20_RREF_EXT_EN_AON_LEN) - 1) << AON_USB20_RREF_EXT_EN_AON_POS)
#define AON_USB20_RREF_EXT_EN_AON_UMSK (~(((1U << AON_USB20_RREF_EXT_EN_AON_LEN) - 1) << AON_USB20_RREF_EXT_EN_AON_POS))
#define AON_EN_POR33_AON               AON_EN_POR33_AON
#define AON_EN_POR33_AON_POS           (20U)
#define AON_EN_POR33_AON_LEN           (1U)
#define AON_EN_POR33_AON_MSK           (((1U << AON_EN_POR33_AON_LEN) - 1) << AON_EN_POR33_AON_POS)
#define AON_EN_POR33_AON_UMSK          (~(((1U << AON_EN_POR33_AON_LEN) - 1) << AON_EN_POR33_AON_POS))
#define AON_USB20_RREF_HIZ_AON         AON_USB20_RREF_HIZ_AON
#define AON_USB20_RREF_HIZ_AON_POS     (21U)
#define AON_USB20_RREF_HIZ_AON_LEN     (1U)
#define AON_USB20_RREF_HIZ_AON_MSK     (((1U << AON_USB20_RREF_HIZ_AON_LEN) - 1) << AON_USB20_RREF_HIZ_AON_POS)
#define AON_USB20_RREF_HIZ_AON_UMSK    (~(((1U << AON_USB20_RREF_HIZ_AON_LEN) - 1) << AON_USB20_RREF_HIZ_AON_POS))
#define AON_USB20_RCAL_CODE_AON        AON_USB20_RCAL_CODE_AON
#define AON_USB20_RCAL_CODE_AON_POS    (24U)
#define AON_USB20_RCAL_CODE_AON_LEN    (6U)
#define AON_USB20_RCAL_CODE_AON_MSK    (((1U << AON_USB20_RCAL_CODE_AON_LEN) - 1) << AON_USB20_RCAL_CODE_AON_POS)
#define AON_USB20_RCAL_CODE_AON_UMSK   (~(((1U << AON_USB20_RCAL_CODE_AON_LEN) - 1) << AON_USB20_RCAL_CODE_AON_POS))

