XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/aon_reg.h
/* 0x880 : rf_top_aon */
#define AON_RF_TOP_AON_OFFSET             (0x880)
#define AON_PU_MBG_AON                    AON_PU_MBG_AON
#define AON_PU_MBG_AON_POS                (0U)
#define AON_PU_MBG_AON_LEN                (1U)
#define AON_PU_MBG_AON_MSK                (((1U << AON_PU_MBG_AON_LEN) - 1) << AON_PU_MBG_AON_POS)
#define AON_PU_MBG_AON_UMSK               (~(((1U << AON_PU_MBG_AON_LEN) - 1) << AON_PU_MBG_AON_POS))
#define AON_PU_LDO15RF_AON                AON_PU_LDO15RF_AON
#define AON_PU_LDO15RF_AON_POS            (1U)
#define AON_PU_LDO15RF_AON_LEN            (1U)
#define AON_PU_LDO15RF_AON_MSK            (((1U << AON_PU_LDO15RF_AON_LEN) - 1) << AON_PU_LDO15RF_AON_POS)
#define AON_PU_LDO15RF_AON_UMSK           (~(((1U << AON_PU_LDO15RF_AON_LEN) - 1) << AON_PU_LDO15RF_AON_POS))
#define AON_PU_SFREG_AON                  AON_PU_SFREG_AON
#define AON_PU_SFREG_AON_POS              (2U)
#define AON_PU_SFREG_AON_LEN              (1U)
#define AON_PU_SFREG_AON_MSK              (((1U << AON_PU_SFREG_AON_LEN) - 1) << AON_PU_SFREG_AON_POS)
#define AON_PU_SFREG_AON_UMSK             (~(((1U << AON_PU_SFREG_AON_LEN) - 1) << AON_PU_SFREG_AON_POS))
#define AON_PU_XTAL_BUF_AON               AON_PU_XTAL_BUF_AON
#define AON_PU_XTAL_BUF_AON_POS           (4U)
#define AON_PU_XTAL_BUF_AON_LEN           (1U)
#define AON_PU_XTAL_BUF_AON_MSK           (((1U << AON_PU_XTAL_BUF_AON_LEN) - 1) << AON_PU_XTAL_BUF_AON_POS)
#define AON_PU_XTAL_BUF_AON_UMSK          (~(((1U << AON_PU_XTAL_BUF_AON_LEN) - 1) << AON_PU_XTAL_BUF_AON_POS))
#define AON_PU_XTAL_AON                   AON_PU_XTAL_AON
#define AON_PU_XTAL_AON_POS               (5U)
#define AON_PU_XTAL_AON_LEN               (1U)
#define AON_PU_XTAL_AON_MSK               (((1U << AON_PU_XTAL_AON_LEN) - 1) << AON_PU_XTAL_AON_POS)
#define AON_PU_XTAL_AON_UMSK              (~(((1U << AON_PU_XTAL_AON_LEN) - 1) << AON_PU_XTAL_AON_POS))
#define AON_LDO15RF_SSTART_SEL_AON        AON_LDO15RF_SSTART_SEL_AON
#define AON_LDO15RF_SSTART_SEL_AON_POS    (8U)
#define AON_LDO15RF_SSTART_SEL_AON_LEN    (1U)
#define AON_LDO15RF_SSTART_SEL_AON_MSK    (((1U << AON_LDO15RF_SSTART_SEL_AON_LEN) - 1) << AON_LDO15RF_SSTART_SEL_AON_POS)
#define AON_LDO15RF_SSTART_SEL_AON_UMSK   (~(((1U << AON_LDO15RF_SSTART_SEL_AON_LEN) - 1) << AON_LDO15RF_SSTART_SEL_AON_POS))
#define AON_LDO15RF_SSTART_DELAY_AON      AON_LDO15RF_SSTART_DELAY_AON
#define AON_LDO15RF_SSTART_DELAY_AON_POS  (9U)
#define AON_LDO15RF_SSTART_DELAY_AON_LEN  (2U)
#define AON_LDO15RF_SSTART_DELAY_AON_MSK  (((1U << AON_LDO15RF_SSTART_DELAY_AON_LEN) - 1) << AON_LDO15RF_SSTART_DELAY_AON_POS)
#define AON_LDO15RF_SSTART_DELAY_AON_UMSK (~(((1U << AON_LDO15RF_SSTART_DELAY_AON_LEN) - 1) << AON_LDO15RF_SSTART_DELAY_AON_POS))
#define AON_LDO15RF_PULLDOWN_AON          AON_LDO15RF_PULLDOWN_AON
#define AON_LDO15RF_PULLDOWN_AON_POS      (12U)
#define AON_LDO15RF_PULLDOWN_AON_LEN      (1U)
#define AON_LDO15RF_PULLDOWN_AON_MSK      (((1U << AON_LDO15RF_PULLDOWN_AON_LEN) - 1) << AON_LDO15RF_PULLDOWN_AON_POS)
#define AON_LDO15RF_PULLDOWN_AON_UMSK     (~(((1U << AON_LDO15RF_PULLDOWN_AON_LEN) - 1) << AON_LDO15RF_PULLDOWN_AON_POS))
#define AON_LDO15RF_PULLDOWN_SEL_AON      AON_LDO15RF_PULLDOWN_SEL_AON
#define AON_LDO15RF_PULLDOWN_SEL_AON_POS  (13U)
#define AON_LDO15RF_PULLDOWN_SEL_AON_LEN  (1U)
#define AON_LDO15RF_PULLDOWN_SEL_AON_MSK  (((1U << AON_LDO15RF_PULLDOWN_SEL_AON_LEN) - 1) << AON_LDO15RF_PULLDOWN_SEL_AON_POS)
#define AON_LDO15RF_PULLDOWN_SEL_AON_UMSK (~(((1U << AON_LDO15RF_PULLDOWN_SEL_AON_LEN) - 1) << AON_LDO15RF_PULLDOWN_SEL_AON_POS))
#define AON_LDO15RF_VOUT_SEL_AON          AON_LDO15RF_VOUT_SEL_AON
#define AON_LDO15RF_VOUT_SEL_AON_POS      (16U)
#define AON_LDO15RF_VOUT_SEL_AON_LEN      (3U)
#define AON_LDO15RF_VOUT_SEL_AON_MSK      (((1U << AON_LDO15RF_VOUT_SEL_AON_LEN) - 1) << AON_LDO15RF_VOUT_SEL_AON_POS)
#define AON_LDO15RF_VOUT_SEL_AON_UMSK     (~(((1U << AON_LDO15RF_VOUT_SEL_AON_LEN) - 1) << AON_LDO15RF_VOUT_SEL_AON_POS))
#define AON_LDO15RF_CC_AON                AON_LDO15RF_CC_AON
#define AON_LDO15RF_CC_AON_POS            (24U)
#define AON_LDO15RF_CC_AON_LEN            (2U)
#define AON_LDO15RF_CC_AON_MSK            (((1U << AON_LDO15RF_CC_AON_LEN) - 1) << AON_LDO15RF_CC_AON_POS)
#define AON_LDO15RF_CC_AON_UMSK           (~(((1U << AON_LDO15RF_CC_AON_LEN) - 1) << AON_LDO15RF_CC_AON_POS))
#define AON_LDO15RF_BYPASS_AON            AON_LDO15RF_BYPASS_AON
#define AON_LDO15RF_BYPASS_AON_POS        (28U)
#define AON_LDO15RF_BYPASS_AON_LEN        (1U)
#define AON_LDO15RF_BYPASS_AON_MSK        (((1U << AON_LDO15RF_BYPASS_AON_LEN) - 1) << AON_LDO15RF_BYPASS_AON_POS)
#define AON_LDO15RF_BYPASS_AON_UMSK       (~(((1U << AON_LDO15RF_BYPASS_AON_LEN) - 1) << AON_LDO15RF_BYPASS_AON_POS))

/* 0x884 : xtal_cfg */
#define AON_XTAL_CFG_OFFSET             (0x884)
#define AON_XTAL_BK_AON                 AON_XTAL_BK_AON
#define AON_XTAL_BK_AON_POS             (0U)
#define AON_XTAL_BK_AON_LEN             (2U)
#define AON_XTAL_BK_AON_MSK             (((1U << AON_XTAL_BK_AON_LEN) - 1) << AON_XTAL_BK_AON_POS)
#define AON_XTAL_BK_AON_UMSK            (~(((1U << AON_XTAL_BK_AON_LEN) - 1) << AON_XTAL_BK_AON_POS))
#define AON_XTAL_CAPCODE_EXTRA_AON      AON_XTAL_CAPCODE_EXTRA_AON
#define AON_XTAL_CAPCODE_EXTRA_AON_POS  (2U)
#define AON_XTAL_CAPCODE_EXTRA_AON_LEN  (1U)
#define AON_XTAL_CAPCODE_EXTRA_AON_MSK  (((1U << AON_XTAL_CAPCODE_EXTRA_AON_LEN) - 1) << AON_XTAL_CAPCODE_EXTRA_AON_POS)
#define AON_XTAL_CAPCODE_EXTRA_AON_UMSK (~(((1U << AON_XTAL_CAPCODE_EXTRA_AON_LEN) - 1) << AON_XTAL_CAPCODE_EXTRA_AON_POS))
#define AON_XTAL_EXT_SEL_AON            AON_XTAL_EXT_SEL_AON
#define AON_XTAL_EXT_SEL_AON_POS        (3U)
#define AON_XTAL_EXT_SEL_AON_LEN        (1U)
#define AON_XTAL_EXT_SEL_AON_MSK        (((1U << AON_XTAL_EXT_SEL_AON_LEN) - 1) << AON_XTAL_EXT_SEL_AON_POS)
#define AON_XTAL_EXT_SEL_AON_UMSK       (~(((1U << AON_XTAL_EXT_SEL_AON_LEN) - 1) << AON_XTAL_EXT_SEL_AON_POS))
#define AON_XTAL_BUF_EN_AON             AON_XTAL_BUF_EN_AON
#define AON_XTAL_BUF_EN_AON_POS         (4U)
#define AON_XTAL_BUF_EN_AON_LEN         (4U)
#define AON_XTAL_BUF_EN_AON_MSK         (((1U << AON_XTAL_BUF_EN_AON_LEN) - 1) << AON_XTAL_BUF_EN_AON_POS)
#define AON_XTAL_BUF_EN_AON_UMSK        (~(((1U << AON_XTAL_BUF_EN_AON_LEN) - 1) << AON_XTAL_BUF_EN_AON_POS))
#define AON_XTAL_BUF_HP_AON             AON_XTAL_BUF_HP_AON
#define AON_XTAL_BUF_HP_AON_POS         (8U)
#define AON_XTAL_BUF_HP_AON_LEN         (4U)
#define AON_XTAL_BUF_HP_AON_MSK         (((1U << AON_XTAL_BUF_HP_AON_LEN) - 1) << AON_XTAL_BUF_HP_AON_POS)
#define AON_XTAL_BUF_HP_AON_UMSK        (~(((1U << AON_XTAL_BUF_HP_AON_LEN) - 1) << AON_XTAL_BUF_HP_AON_POS))
#define AON_XTAL_FAST_STARTUP_AON       AON_XTAL_FAST_STARTUP_AON
#define AON_XTAL_FAST_STARTUP_AON_POS   (12U)
#define AON_XTAL_FAST_STARTUP_AON_LEN   (1U)
#define AON_XTAL_FAST_STARTUP_AON_MSK   (((1U << AON_XTAL_FAST_STARTUP_AON_LEN) - 1) << AON_XTAL_FAST_STARTUP_AON_POS)
#define AON_XTAL_FAST_STARTUP_AON_UMSK  (~(((1U << AON_XTAL_FAST_STARTUP_AON_LEN) - 1) << AON_XTAL_FAST_STARTUP_AON_POS))
#define AON_XTAL_SLEEP_AON              AON_XTAL_SLEEP_AON
#define AON_XTAL_SLEEP_AON_POS          (13U)
#define AON_XTAL_SLEEP_AON_LEN          (1U)
#define AON_XTAL_SLEEP_AON_MSK          (((1U << AON_XTAL_SLEEP_AON_LEN) - 1) << AON_XTAL_SLEEP_AON_POS)
#define AON_XTAL_SLEEP_AON_UMSK         (~(((1U << AON_XTAL_SLEEP_AON_LEN) - 1) << AON_XTAL_SLEEP_AON_POS))
#define AON_XTAL_AMP_CTRL_AON           AON_XTAL_AMP_CTRL_AON
#define AON_XTAL_AMP_CTRL_AON_POS       (14U)
#define AON_XTAL_AMP_CTRL_AON_LEN       (2U)
#define AON_XTAL_AMP_CTRL_AON_MSK       (((1U << AON_XTAL_AMP_CTRL_AON_LEN) - 1) << AON_XTAL_AMP_CTRL_AON_POS)
#define AON_XTAL_AMP_CTRL_AON_UMSK      (~(((1U << AON_XTAL_AMP_CTRL_AON_LEN) - 1) << AON_XTAL_AMP_CTRL_AON_POS))
#define AON_XTAL_CAPCODE_OUT_AON        AON_XTAL_CAPCODE_OUT_AON
#define AON_XTAL_CAPCODE_OUT_AON_POS    (16U)
#define AON_XTAL_CAPCODE_OUT_AON_LEN    (6U)
#define AON_XTAL_CAPCODE_OUT_AON_MSK    (((1U << AON_XTAL_CAPCODE_OUT_AON_LEN) - 1) << AON_XTAL_CAPCODE_OUT_AON_POS)
#define AON_XTAL_CAPCODE_OUT_AON_UMSK   (~(((1U << AON_XTAL_CAPCODE_OUT_AON_LEN) - 1) << AON_XTAL_CAPCODE_OUT_AON_POS))
#define AON_XTAL_CAPCODE_IN_AON         AON_XTAL_CAPCODE_IN_AON
#define AON_XTAL_CAPCODE_IN_AON_POS     (22U)
#define AON_XTAL_CAPCODE_IN_AON_LEN     (6U)
#define AON_XTAL_CAPCODE_IN_AON_MSK     (((1U << AON_XTAL_CAPCODE_IN_AON_LEN) - 1) << AON_XTAL_CAPCODE_IN_AON_POS)
#define AON_XTAL_CAPCODE_IN_AON_UMSK    (~(((1U << AON_XTAL_CAPCODE_IN_AON_LEN) - 1) << AON_XTAL_CAPCODE_IN_AON_POS))
#define AON_XTAL_GM_BOOST_AON           AON_XTAL_GM_BOOST_AON
#define AON_XTAL_GM_BOOST_AON_POS       (28U)
#define AON_XTAL_GM_BOOST_AON_LEN       (2U)
#define AON_XTAL_GM_BOOST_AON_MSK       (((1U << AON_XTAL_GM_BOOST_AON_LEN) - 1) << AON_XTAL_GM_BOOST_AON_POS)
#define AON_XTAL_GM_BOOST_AON_UMSK      (~(((1U << AON_XTAL_GM_BOOST_AON_LEN) - 1) << AON_XTAL_GM_BOOST_AON_POS))
#define AON_XTAL_RDY_SEL_AON            AON_XTAL_RDY_SEL_AON
#define AON_XTAL_RDY_SEL_AON_POS        (30U)
#define AON_XTAL_RDY_SEL_AON_LEN        (2U)
#define AON_XTAL_RDY_SEL_AON_MSK        (((1U << AON_XTAL_RDY_SEL_AON_LEN) - 1) << AON_XTAL_RDY_SEL_AON_POS)
#define AON_XTAL_RDY_SEL_AON_UMSK       (~(((1U << AON_XTAL_RDY_SEL_AON_LEN) - 1) << AON_XTAL_RDY_SEL_AON_POS))

/* 0x888 : xtal_cfg2 */
#define AON_XTAL_CFG2_OFFSET                      (0x888)
#define AON_WIFI_XTAL_LDO33_BYPASS_AON            AON_WIFI_XTAL_LDO33_BYPASS_AON
#define AON_WIFI_XTAL_LDO33_BYPASS_AON_POS        (0U)
#define AON_WIFI_XTAL_LDO33_BYPASS_AON_LEN        (1U)
#define AON_WIFI_XTAL_LDO33_BYPASS_AON_MSK        (((1U << AON_WIFI_XTAL_LDO33_BYPASS_AON_LEN) - 1) << AON_WIFI_XTAL_LDO33_BYPASS_AON_POS)
#define AON_WIFI_XTAL_LDO33_BYPASS_AON_UMSK       (~(((1U << AON_WIFI_XTAL_LDO33_BYPASS_AON_LEN) - 1) << AON_WIFI_XTAL_LDO33_BYPASS_AON_POS))
#define AON_WIFI_XTAL_LDO33_SEL_AON               AON_WIFI_XTAL_LDO33_SEL_AON
#define AON_WIFI_XTAL_LDO33_SEL_AON_POS           (1U)
#define AON_WIFI_XTAL_LDO33_SEL_AON_LEN           (3U)
#define AON_WIFI_XTAL_LDO33_SEL_AON_MSK           (((1U << AON_WIFI_XTAL_LDO33_SEL_AON_LEN) - 1) << AON_WIFI_XTAL_LDO33_SEL_AON_POS)
#define AON_WIFI_XTAL_LDO33_SEL_AON_UMSK          (~(((1U << AON_WIFI_XTAL_LDO33_SEL_AON_LEN) - 1) << AON_WIFI_XTAL_LDO33_SEL_AON_POS))
#define AON_WIFI_XTAL_LDO18_SEL_AON               AON_WIFI_XTAL_LDO18_SEL_AON
#define AON_WIFI_XTAL_LDO18_SEL_AON_POS           (4U)
#define AON_WIFI_XTAL_LDO18_SEL_AON_LEN           (2U)
#define AON_WIFI_XTAL_LDO18_SEL_AON_MSK           (((1U << AON_WIFI_XTAL_LDO18_SEL_AON_LEN) - 1) << AON_WIFI_XTAL_LDO18_SEL_AON_POS)
#define AON_WIFI_XTAL_LDO18_SEL_AON_UMSK          (~(((1U << AON_WIFI_XTAL_LDO18_SEL_AON_LEN) - 1) << AON_WIFI_XTAL_LDO18_SEL_AON_POS))
#define AON_WIFI_XTAL_LDO33_PU_AON                AON_WIFI_XTAL_LDO33_PU_AON
#define AON_WIFI_XTAL_LDO33_PU_AON_POS            (6U)
#define AON_WIFI_XTAL_LDO33_PU_AON_LEN            (1U)
#define AON_WIFI_XTAL_LDO33_PU_AON_MSK            (((1U << AON_WIFI_XTAL_LDO33_PU_AON_LEN) - 1) << AON_WIFI_XTAL_LDO33_PU_AON_POS)
#define AON_WIFI_XTAL_LDO33_PU_AON_UMSK           (~(((1U << AON_WIFI_XTAL_LDO33_PU_AON_LEN) - 1) << AON_WIFI_XTAL_LDO33_PU_AON_POS))
#define AON_WIFI_XTAL_LDO18_PU_AON                AON_WIFI_XTAL_LDO18_PU_AON
#define AON_WIFI_XTAL_LDO18_PU_AON_POS            (7U)
#define AON_WIFI_XTAL_LDO18_PU_AON_LEN            (1U)
#define AON_WIFI_XTAL_LDO18_PU_AON_MSK            (((1U << AON_WIFI_XTAL_LDO18_PU_AON_LEN) - 1) << AON_WIFI_XTAL_LDO18_PU_AON_POS)
#define AON_WIFI_XTAL_LDO18_PU_AON_UMSK           (~(((1U << AON_WIFI_XTAL_LDO18_PU_AON_LEN) - 1) << AON_WIFI_XTAL_LDO18_PU_AON_POS))
#define AON_WIFI_XTAL_RESERVE                     AON_WIFI_XTAL_RESERVE
#define AON_WIFI_XTAL_RESERVE_POS                 (10U)
#define AON_WIFI_XTAL_RESERVE_LEN                 (4U)
#define AON_WIFI_XTAL_RESERVE_MSK                 (((1U << AON_WIFI_XTAL_RESERVE_LEN) - 1) << AON_WIFI_XTAL_RESERVE_POS)
#define AON_WIFI_XTAL_RESERVE_UMSK                (~(((1U << AON_WIFI_XTAL_RESERVE_LEN) - 1) << AON_WIFI_XTAL_RESERVE_POS))
#define AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON      AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON
#define AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON_POS  (16U)
#define AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON_LEN  (1U)
#define AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON_MSK  (((1U << AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON_LEN) - 1) << AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON_POS)
#define AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON_UMSK (~(((1U << AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON_LEN) - 1) << AON_WIFI_XTAL_LDO18_SHORT_FILTER_AON_POS))
#define AON_XTAL_BUF_DRV_AON                      AON_XTAL_BUF_DRV_AON
#define AON_XTAL_BUF_DRV_AON_POS                  (30U)
#define AON_XTAL_BUF_DRV_AON_LEN                  (2U)
#define AON_XTAL_BUF_DRV_AON_MSK                  (((1U << AON_XTAL_BUF_DRV_AON_LEN) - 1) << AON_XTAL_BUF_DRV_AON_POS)
#define AON_XTAL_BUF_DRV_AON_UMSK                 (~(((1U << AON_XTAL_BUF_DRV_AON_LEN) - 1) << AON_XTAL_BUF_DRV_AON_POS))

