XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/aon_reg.h
/* 0x90C : gpadc_reg_cmd */
#define AON_GPADC_REG_CMD_OFFSET        (0x90C)
#define AON_GPADC_GLOBAL_EN             AON_GPADC_GLOBAL_EN
#define AON_GPADC_GLOBAL_EN_POS         (0U)
#define AON_GPADC_GLOBAL_EN_LEN         (1U)
#define AON_GPADC_GLOBAL_EN_MSK         (((1U << AON_GPADC_GLOBAL_EN_LEN) - 1) << AON_GPADC_GLOBAL_EN_POS)
#define AON_GPADC_GLOBAL_EN_UMSK        (~(((1U << AON_GPADC_GLOBAL_EN_LEN) - 1) << AON_GPADC_GLOBAL_EN_POS))
#define AON_GPADC_CONV_START            AON_GPADC_CONV_START
#define AON_GPADC_CONV_START_POS        (1U)
#define AON_GPADC_CONV_START_LEN        (1U)
#define AON_GPADC_CONV_START_MSK        (((1U << AON_GPADC_CONV_START_LEN) - 1) << AON_GPADC_CONV_START_POS)
#define AON_GPADC_CONV_START_UMSK       (~(((1U << AON_GPADC_CONV_START_LEN) - 1) << AON_GPADC_CONV_START_POS))
#define AON_GPADC_SOFT_RST              AON_GPADC_SOFT_RST
#define AON_GPADC_SOFT_RST_POS          (2U)
#define AON_GPADC_SOFT_RST_LEN          (1U)
#define AON_GPADC_SOFT_RST_MSK          (((1U << AON_GPADC_SOFT_RST_LEN) - 1) << AON_GPADC_SOFT_RST_POS)
#define AON_GPADC_SOFT_RST_UMSK         (~(((1U << AON_GPADC_SOFT_RST_LEN) - 1) << AON_GPADC_SOFT_RST_POS))
#define AON_GPADC_NEG_SEL               AON_GPADC_NEG_SEL
#define AON_GPADC_NEG_SEL_POS           (3U)
#define AON_GPADC_NEG_SEL_LEN           (5U)
#define AON_GPADC_NEG_SEL_MSK           (((1U << AON_GPADC_NEG_SEL_LEN) - 1) << AON_GPADC_NEG_SEL_POS)
#define AON_GPADC_NEG_SEL_UMSK          (~(((1U << AON_GPADC_NEG_SEL_LEN) - 1) << AON_GPADC_NEG_SEL_POS))
#define AON_GPADC_POS_SEL               AON_GPADC_POS_SEL
#define AON_GPADC_POS_SEL_POS           (8U)
#define AON_GPADC_POS_SEL_LEN           (5U)
#define AON_GPADC_POS_SEL_MSK           (((1U << AON_GPADC_POS_SEL_LEN) - 1) << AON_GPADC_POS_SEL_POS)
#define AON_GPADC_POS_SEL_UMSK          (~(((1U << AON_GPADC_POS_SEL_LEN) - 1) << AON_GPADC_POS_SEL_POS))
#define AON_GPADC_NEG_GND               AON_GPADC_NEG_GND
#define AON_GPADC_NEG_GND_POS           (13U)
#define AON_GPADC_NEG_GND_LEN           (1U)
#define AON_GPADC_NEG_GND_MSK           (((1U << AON_GPADC_NEG_GND_LEN) - 1) << AON_GPADC_NEG_GND_POS)
#define AON_GPADC_NEG_GND_UMSK          (~(((1U << AON_GPADC_NEG_GND_LEN) - 1) << AON_GPADC_NEG_GND_POS))
#define AON_GPADC_MICBIAS_EN            AON_GPADC_MICBIAS_EN
#define AON_GPADC_MICBIAS_EN_POS        (14U)
#define AON_GPADC_MICBIAS_EN_LEN        (1U)
#define AON_GPADC_MICBIAS_EN_MSK        (((1U << AON_GPADC_MICBIAS_EN_LEN) - 1) << AON_GPADC_MICBIAS_EN_POS)
#define AON_GPADC_MICBIAS_EN_UMSK       (~(((1U << AON_GPADC_MICBIAS_EN_LEN) - 1) << AON_GPADC_MICBIAS_EN_POS))
#define AON_GPADC_MICPGA_EN             AON_GPADC_MICPGA_EN
#define AON_GPADC_MICPGA_EN_POS         (15U)
#define AON_GPADC_MICPGA_EN_LEN         (1U)
#define AON_GPADC_MICPGA_EN_MSK         (((1U << AON_GPADC_MICPGA_EN_LEN) - 1) << AON_GPADC_MICPGA_EN_POS)
#define AON_GPADC_MICPGA_EN_UMSK        (~(((1U << AON_GPADC_MICPGA_EN_LEN) - 1) << AON_GPADC_MICPGA_EN_POS))
#define AON_GPADC_BYP_MICBOOST          AON_GPADC_BYP_MICBOOST
#define AON_GPADC_BYP_MICBOOST_POS      (16U)
#define AON_GPADC_BYP_MICBOOST_LEN      (1U)
#define AON_GPADC_BYP_MICBOOST_MSK      (((1U << AON_GPADC_BYP_MICBOOST_LEN) - 1) << AON_GPADC_BYP_MICBOOST_POS)
#define AON_GPADC_BYP_MICBOOST_UMSK     (~(((1U << AON_GPADC_BYP_MICBOOST_LEN) - 1) << AON_GPADC_BYP_MICBOOST_POS))
#define AON_GPADC_RCAL_EN               AON_GPADC_RCAL_EN
#define AON_GPADC_RCAL_EN_POS           (17U)
#define AON_GPADC_RCAL_EN_LEN           (1U)
#define AON_GPADC_RCAL_EN_MSK           (((1U << AON_GPADC_RCAL_EN_LEN) - 1) << AON_GPADC_RCAL_EN_POS)
#define AON_GPADC_RCAL_EN_UMSK          (~(((1U << AON_GPADC_RCAL_EN_LEN) - 1) << AON_GPADC_RCAL_EN_POS))
#define AON_GPADC_DWA_EN                AON_GPADC_DWA_EN
#define AON_GPADC_DWA_EN_POS            (18U)
#define AON_GPADC_DWA_EN_LEN            (1U)
#define AON_GPADC_DWA_EN_MSK            (((1U << AON_GPADC_DWA_EN_LEN) - 1) << AON_GPADC_DWA_EN_POS)
#define AON_GPADC_DWA_EN_UMSK           (~(((1U << AON_GPADC_DWA_EN_LEN) - 1) << AON_GPADC_DWA_EN_POS))
#define AON_GPADC_MIC2_DIFF             AON_GPADC_MIC2_DIFF
#define AON_GPADC_MIC2_DIFF_POS         (19U)
#define AON_GPADC_MIC2_DIFF_LEN         (1U)
#define AON_GPADC_MIC2_DIFF_MSK         (((1U << AON_GPADC_MIC2_DIFF_LEN) - 1) << AON_GPADC_MIC2_DIFF_POS)
#define AON_GPADC_MIC2_DIFF_UMSK        (~(((1U << AON_GPADC_MIC2_DIFF_LEN) - 1) << AON_GPADC_MIC2_DIFF_POS))
#define AON_GPADC_MIC1_DIFF             AON_GPADC_MIC1_DIFF
#define AON_GPADC_MIC1_DIFF_POS         (20U)
#define AON_GPADC_MIC1_DIFF_LEN         (1U)
#define AON_GPADC_MIC1_DIFF_MSK         (((1U << AON_GPADC_MIC1_DIFF_LEN) - 1) << AON_GPADC_MIC1_DIFF_POS)
#define AON_GPADC_MIC1_DIFF_UMSK        (~(((1U << AON_GPADC_MIC1_DIFF_LEN) - 1) << AON_GPADC_MIC1_DIFF_POS))
#define AON_GPADC_MIC_PGA2_GAIN         AON_GPADC_MIC_PGA2_GAIN
#define AON_GPADC_MIC_PGA2_GAIN_POS     (21U)
#define AON_GPADC_MIC_PGA2_GAIN_LEN     (2U)
#define AON_GPADC_MIC_PGA2_GAIN_MSK     (((1U << AON_GPADC_MIC_PGA2_GAIN_LEN) - 1) << AON_GPADC_MIC_PGA2_GAIN_POS)
#define AON_GPADC_MIC_PGA2_GAIN_UMSK    (~(((1U << AON_GPADC_MIC_PGA2_GAIN_LEN) - 1) << AON_GPADC_MIC_PGA2_GAIN_POS))
#define AON_GPADC_MICBOOST_32DB_EN      AON_GPADC_MICBOOST_32DB_EN
#define AON_GPADC_MICBOOST_32DB_EN_POS  (23U)
#define AON_GPADC_MICBOOST_32DB_EN_LEN  (1U)
#define AON_GPADC_MICBOOST_32DB_EN_MSK  (((1U << AON_GPADC_MICBOOST_32DB_EN_LEN) - 1) << AON_GPADC_MICBOOST_32DB_EN_POS)
#define AON_GPADC_MICBOOST_32DB_EN_UMSK (~(((1U << AON_GPADC_MICBOOST_32DB_EN_LEN) - 1) << AON_GPADC_MICBOOST_32DB_EN_POS))
#define AON_GPADC_CHIP_SEN_PU           AON_GPADC_CHIP_SEN_PU
#define AON_GPADC_CHIP_SEN_PU_POS       (27U)
#define AON_GPADC_CHIP_SEN_PU_LEN       (1U)
#define AON_GPADC_CHIP_SEN_PU_MSK       (((1U << AON_GPADC_CHIP_SEN_PU_LEN) - 1) << AON_GPADC_CHIP_SEN_PU_POS)
#define AON_GPADC_CHIP_SEN_PU_UMSK      (~(((1U << AON_GPADC_CHIP_SEN_PU_LEN) - 1) << AON_GPADC_CHIP_SEN_PU_POS))
#define AON_GPADC_SEN_SEL               AON_GPADC_SEN_SEL
#define AON_GPADC_SEN_SEL_POS           (28U)
#define AON_GPADC_SEN_SEL_LEN           (3U)
#define AON_GPADC_SEN_SEL_MSK           (((1U << AON_GPADC_SEN_SEL_LEN) - 1) << AON_GPADC_SEN_SEL_POS)
#define AON_GPADC_SEN_SEL_UMSK          (~(((1U << AON_GPADC_SEN_SEL_LEN) - 1) << AON_GPADC_SEN_SEL_POS))
#define AON_GPADC_SEN_TEST_EN           AON_GPADC_SEN_TEST_EN
#define AON_GPADC_SEN_TEST_EN_POS       (31U)
#define AON_GPADC_SEN_TEST_EN_LEN       (1U)
#define AON_GPADC_SEN_TEST_EN_MSK       (((1U << AON_GPADC_SEN_TEST_EN_LEN) - 1) << AON_GPADC_SEN_TEST_EN_POS)
#define AON_GPADC_SEN_TEST_EN_UMSK      (~(((1U << AON_GPADC_SEN_TEST_EN_LEN) - 1) << AON_GPADC_SEN_TEST_EN_POS))

/* 0x910 : gpadc_reg_config1 */
#define AON_GPADC_REG_CONFIG1_OFFSET  (0x910)
#define AON_GPADC_CAL_OS_EN           AON_GPADC_CAL_OS_EN
#define AON_GPADC_CAL_OS_EN_POS       (0U)
#define AON_GPADC_CAL_OS_EN_LEN       (1U)
#define AON_GPADC_CAL_OS_EN_MSK       (((1U << AON_GPADC_CAL_OS_EN_LEN) - 1) << AON_GPADC_CAL_OS_EN_POS)
#define AON_GPADC_CAL_OS_EN_UMSK      (~(((1U << AON_GPADC_CAL_OS_EN_LEN) - 1) << AON_GPADC_CAL_OS_EN_POS))
#define AON_GPADC_CONT_CONV_EN        AON_GPADC_CONT_CONV_EN
#define AON_GPADC_CONT_CONV_EN_POS    (1U)
#define AON_GPADC_CONT_CONV_EN_LEN    (1U)
#define AON_GPADC_CONT_CONV_EN_MSK    (((1U << AON_GPADC_CONT_CONV_EN_LEN) - 1) << AON_GPADC_CONT_CONV_EN_POS)
#define AON_GPADC_CONT_CONV_EN_UMSK   (~(((1U << AON_GPADC_CONT_CONV_EN_LEN) - 1) << AON_GPADC_CONT_CONV_EN_POS))
#define AON_GPADC_RES_SEL             AON_GPADC_RES_SEL
#define AON_GPADC_RES_SEL_POS         (2U)
#define AON_GPADC_RES_SEL_LEN         (3U)
#define AON_GPADC_RES_SEL_MSK         (((1U << AON_GPADC_RES_SEL_LEN) - 1) << AON_GPADC_RES_SEL_POS)
#define AON_GPADC_RES_SEL_UMSK        (~(((1U << AON_GPADC_RES_SEL_LEN) - 1) << AON_GPADC_RES_SEL_POS))
#define AON_GPADC_VCM_SEL_EN          AON_GPADC_VCM_SEL_EN
#define AON_GPADC_VCM_SEL_EN_POS      (8U)
#define AON_GPADC_VCM_SEL_EN_LEN      (1U)
#define AON_GPADC_VCM_SEL_EN_MSK      (((1U << AON_GPADC_VCM_SEL_EN_LEN) - 1) << AON_GPADC_VCM_SEL_EN_POS)
#define AON_GPADC_VCM_SEL_EN_UMSK     (~(((1U << AON_GPADC_VCM_SEL_EN_LEN) - 1) << AON_GPADC_VCM_SEL_EN_POS))
#define AON_GPADC_VCM_HYST_SEL        AON_GPADC_VCM_HYST_SEL
#define AON_GPADC_VCM_HYST_SEL_POS    (9U)
#define AON_GPADC_VCM_HYST_SEL_LEN    (1U)
#define AON_GPADC_VCM_HYST_SEL_MSK    (((1U << AON_GPADC_VCM_HYST_SEL_LEN) - 1) << AON_GPADC_VCM_HYST_SEL_POS)
#define AON_GPADC_VCM_HYST_SEL_UMSK   (~(((1U << AON_GPADC_VCM_HYST_SEL_LEN) - 1) << AON_GPADC_VCM_HYST_SEL_POS))
#define AON_GPADC_LOWV_DET_EN         AON_GPADC_LOWV_DET_EN
#define AON_GPADC_LOWV_DET_EN_POS     (10U)
#define AON_GPADC_LOWV_DET_EN_LEN     (1U)
#define AON_GPADC_LOWV_DET_EN_MSK     (((1U << AON_GPADC_LOWV_DET_EN_LEN) - 1) << AON_GPADC_LOWV_DET_EN_POS)
#define AON_GPADC_LOWV_DET_EN_UMSK    (~(((1U << AON_GPADC_LOWV_DET_EN_LEN) - 1) << AON_GPADC_LOWV_DET_EN_POS))
#define AON_GPADC_PWM_TRG_EN          AON_GPADC_PWM_TRG_EN
#define AON_GPADC_PWM_TRG_EN_POS      (11U)
#define AON_GPADC_PWM_TRG_EN_LEN      (1U)
#define AON_GPADC_PWM_TRG_EN_MSK      (((1U << AON_GPADC_PWM_TRG_EN_LEN) - 1) << AON_GPADC_PWM_TRG_EN_POS)
#define AON_GPADC_PWM_TRG_EN_UMSK     (~(((1U << AON_GPADC_PWM_TRG_EN_LEN) - 1) << AON_GPADC_PWM_TRG_EN_POS))
#define AON_GPADC_CLK_ANA_DLY         AON_GPADC_CLK_ANA_DLY
#define AON_GPADC_CLK_ANA_DLY_POS     (12U)
#define AON_GPADC_CLK_ANA_DLY_LEN     (4U)
#define AON_GPADC_CLK_ANA_DLY_MSK     (((1U << AON_GPADC_CLK_ANA_DLY_LEN) - 1) << AON_GPADC_CLK_ANA_DLY_POS)
#define AON_GPADC_CLK_ANA_DLY_UMSK    (~(((1U << AON_GPADC_CLK_ANA_DLY_LEN) - 1) << AON_GPADC_CLK_ANA_DLY_POS))
#define AON_GPADC_CLK_ANA_DLY_EN      AON_GPADC_CLK_ANA_DLY_EN
#define AON_GPADC_CLK_ANA_DLY_EN_POS  (16U)
#define AON_GPADC_CLK_ANA_DLY_EN_LEN  (1U)
#define AON_GPADC_CLK_ANA_DLY_EN_MSK  (((1U << AON_GPADC_CLK_ANA_DLY_EN_LEN) - 1) << AON_GPADC_CLK_ANA_DLY_EN_POS)
#define AON_GPADC_CLK_ANA_DLY_EN_UMSK (~(((1U << AON_GPADC_CLK_ANA_DLY_EN_LEN) - 1) << AON_GPADC_CLK_ANA_DLY_EN_POS))
#define AON_GPADC_CLK_ANA_INV         AON_GPADC_CLK_ANA_INV
#define AON_GPADC_CLK_ANA_INV_POS     (17U)
#define AON_GPADC_CLK_ANA_INV_LEN     (1U)
#define AON_GPADC_CLK_ANA_INV_MSK     (((1U << AON_GPADC_CLK_ANA_INV_LEN) - 1) << AON_GPADC_CLK_ANA_INV_POS)
#define AON_GPADC_CLK_ANA_INV_UMSK    (~(((1U << AON_GPADC_CLK_ANA_INV_LEN) - 1) << AON_GPADC_CLK_ANA_INV_POS))
#define AON_GPADC_CLK_DIV_RATIO       AON_GPADC_CLK_DIV_RATIO
#define AON_GPADC_CLK_DIV_RATIO_POS   (18U)
#define AON_GPADC_CLK_DIV_RATIO_LEN   (3U)
#define AON_GPADC_CLK_DIV_RATIO_MSK   (((1U << AON_GPADC_CLK_DIV_RATIO_LEN) - 1) << AON_GPADC_CLK_DIV_RATIO_POS)
#define AON_GPADC_CLK_DIV_RATIO_UMSK  (~(((1U << AON_GPADC_CLK_DIV_RATIO_LEN) - 1) << AON_GPADC_CLK_DIV_RATIO_POS))
#define AON_GPADC_SCAN_LENGTH         AON_GPADC_SCAN_LENGTH
#define AON_GPADC_SCAN_LENGTH_POS     (21U)
#define AON_GPADC_SCAN_LENGTH_LEN     (4U)
#define AON_GPADC_SCAN_LENGTH_MSK     (((1U << AON_GPADC_SCAN_LENGTH_LEN) - 1) << AON_GPADC_SCAN_LENGTH_POS)
#define AON_GPADC_SCAN_LENGTH_UMSK    (~(((1U << AON_GPADC_SCAN_LENGTH_LEN) - 1) << AON_GPADC_SCAN_LENGTH_POS))
#define AON_GPADC_SCAN_EN             AON_GPADC_SCAN_EN
#define AON_GPADC_SCAN_EN_POS         (25U)
#define AON_GPADC_SCAN_EN_LEN         (1U)
#define AON_GPADC_SCAN_EN_MSK         (((1U << AON_GPADC_SCAN_EN_LEN) - 1) << AON_GPADC_SCAN_EN_POS)
#define AON_GPADC_SCAN_EN_UMSK        (~(((1U << AON_GPADC_SCAN_EN_LEN) - 1) << AON_GPADC_SCAN_EN_POS))
#define AON_GPADC_DITHER_EN           AON_GPADC_DITHER_EN
#define AON_GPADC_DITHER_EN_POS       (26U)
#define AON_GPADC_DITHER_EN_LEN       (1U)
#define AON_GPADC_DITHER_EN_MSK       (((1U << AON_GPADC_DITHER_EN_LEN) - 1) << AON_GPADC_DITHER_EN_POS)
#define AON_GPADC_DITHER_EN_UMSK      (~(((1U << AON_GPADC_DITHER_EN_LEN) - 1) << AON_GPADC_DITHER_EN_POS))
#define AON_GPADC_V11_SEL             AON_GPADC_V11_SEL
#define AON_GPADC_V11_SEL_POS         (27U)
#define AON_GPADC_V11_SEL_LEN         (2U)
#define AON_GPADC_V11_SEL_MSK         (((1U << AON_GPADC_V11_SEL_LEN) - 1) << AON_GPADC_V11_SEL_POS)
#define AON_GPADC_V11_SEL_UMSK        (~(((1U << AON_GPADC_V11_SEL_LEN) - 1) << AON_GPADC_V11_SEL_POS))
#define AON_GPADC_V18_SEL             AON_GPADC_V18_SEL
#define AON_GPADC_V18_SEL_POS         (29U)
#define AON_GPADC_V18_SEL_LEN         (2U)
#define AON_GPADC_V18_SEL_MSK         (((1U << AON_GPADC_V18_SEL_LEN) - 1) << AON_GPADC_V18_SEL_POS)
#define AON_GPADC_V18_SEL_UMSK        (~(((1U << AON_GPADC_V18_SEL_LEN) - 1) << AON_GPADC_V18_SEL_POS))

/* 0x914 : gpadc_reg_config2 */
#define AON_GPADC_REG_CONFIG2_OFFSET (0x914)
#define AON_GPADC_DIFF_MODE          AON_GPADC_DIFF_MODE
#define AON_GPADC_DIFF_MODE_POS      (2U)
#define AON_GPADC_DIFF_MODE_LEN      (1U)
#define AON_GPADC_DIFF_MODE_MSK      (((1U << AON_GPADC_DIFF_MODE_LEN) - 1) << AON_GPADC_DIFF_MODE_POS)
#define AON_GPADC_DIFF_MODE_UMSK     (~(((1U << AON_GPADC_DIFF_MODE_LEN) - 1) << AON_GPADC_DIFF_MODE_POS))
#define AON_GPADC_VREF_SEL           AON_GPADC_VREF_SEL
#define AON_GPADC_VREF_SEL_POS       (3U)
#define AON_GPADC_VREF_SEL_LEN       (1U)
#define AON_GPADC_VREF_SEL_MSK       (((1U << AON_GPADC_VREF_SEL_LEN) - 1) << AON_GPADC_VREF_SEL_POS)
#define AON_GPADC_VREF_SEL_UMSK      (~(((1U << AON_GPADC_VREF_SEL_LEN) - 1) << AON_GPADC_VREF_SEL_POS))
#define AON_GPADC_VBAT_EN            AON_GPADC_VBAT_EN
#define AON_GPADC_VBAT_EN_POS        (4U)
#define AON_GPADC_VBAT_EN_LEN        (1U)
#define AON_GPADC_VBAT_EN_MSK        (((1U << AON_GPADC_VBAT_EN_LEN) - 1) << AON_GPADC_VBAT_EN_POS)
#define AON_GPADC_VBAT_EN_UMSK       (~(((1U << AON_GPADC_VBAT_EN_LEN) - 1) << AON_GPADC_VBAT_EN_POS))
#define AON_GPADC_TSEXT_SEL          AON_GPADC_TSEXT_SEL
#define AON_GPADC_TSEXT_SEL_POS      (5U)
#define AON_GPADC_TSEXT_SEL_LEN      (1U)
#define AON_GPADC_TSEXT_SEL_MSK      (((1U << AON_GPADC_TSEXT_SEL_LEN) - 1) << AON_GPADC_TSEXT_SEL_POS)
#define AON_GPADC_TSEXT_SEL_UMSK     (~(((1U << AON_GPADC_TSEXT_SEL_LEN) - 1) << AON_GPADC_TSEXT_SEL_POS))
#define AON_GPADC_TS_EN              AON_GPADC_TS_EN
#define AON_GPADC_TS_EN_POS          (6U)
#define AON_GPADC_TS_EN_LEN          (1U)
#define AON_GPADC_TS_EN_MSK          (((1U << AON_GPADC_TS_EN_LEN) - 1) << AON_GPADC_TS_EN_POS)
#define AON_GPADC_TS_EN_UMSK         (~(((1U << AON_GPADC_TS_EN_LEN) - 1) << AON_GPADC_TS_EN_POS))
#define AON_GPADC_PGA_VCM            AON_GPADC_PGA_VCM
#define AON_GPADC_PGA_VCM_POS        (7U)
#define AON_GPADC_PGA_VCM_LEN        (2U)
#define AON_GPADC_PGA_VCM_MSK        (((1U << AON_GPADC_PGA_VCM_LEN) - 1) << AON_GPADC_PGA_VCM_POS)
#define AON_GPADC_PGA_VCM_UMSK       (~(((1U << AON_GPADC_PGA_VCM_LEN) - 1) << AON_GPADC_PGA_VCM_POS))
#define AON_GPADC_PGA_OS_CAL         AON_GPADC_PGA_OS_CAL
#define AON_GPADC_PGA_OS_CAL_POS     (9U)
#define AON_GPADC_PGA_OS_CAL_LEN     (4U)
#define AON_GPADC_PGA_OS_CAL_MSK     (((1U << AON_GPADC_PGA_OS_CAL_LEN) - 1) << AON_GPADC_PGA_OS_CAL_POS)
#define AON_GPADC_PGA_OS_CAL_UMSK    (~(((1U << AON_GPADC_PGA_OS_CAL_LEN) - 1) << AON_GPADC_PGA_OS_CAL_POS))
#define AON_GPADC_PGA_EN             AON_GPADC_PGA_EN
#define AON_GPADC_PGA_EN_POS         (13U)
#define AON_GPADC_PGA_EN_LEN         (1U)
#define AON_GPADC_PGA_EN_MSK         (((1U << AON_GPADC_PGA_EN_LEN) - 1) << AON_GPADC_PGA_EN_POS)
#define AON_GPADC_PGA_EN_UMSK        (~(((1U << AON_GPADC_PGA_EN_LEN) - 1) << AON_GPADC_PGA_EN_POS))
#define AON_GPADC_PGA_VCMI_EN        AON_GPADC_PGA_VCMI_EN
#define AON_GPADC_PGA_VCMI_EN_POS    (14U)
#define AON_GPADC_PGA_VCMI_EN_LEN    (1U)
#define AON_GPADC_PGA_VCMI_EN_MSK    (((1U << AON_GPADC_PGA_VCMI_EN_LEN) - 1) << AON_GPADC_PGA_VCMI_EN_POS)
#define AON_GPADC_PGA_VCMI_EN_UMSK   (~(((1U << AON_GPADC_PGA_VCMI_EN_LEN) - 1) << AON_GPADC_PGA_VCMI_EN_POS))
#define AON_GPADC_CHOP_MODE          AON_GPADC_CHOP_MODE
#define AON_GPADC_CHOP_MODE_POS      (15U)
#define AON_GPADC_CHOP_MODE_LEN      (2U)
#define AON_GPADC_CHOP_MODE_MSK      (((1U << AON_GPADC_CHOP_MODE_LEN) - 1) << AON_GPADC_CHOP_MODE_POS)
#define AON_GPADC_CHOP_MODE_UMSK     (~(((1U << AON_GPADC_CHOP_MODE_LEN) - 1) << AON_GPADC_CHOP_MODE_POS))
#define AON_GPADC_BIAS_SEL           AON_GPADC_BIAS_SEL
#define AON_GPADC_BIAS_SEL_POS       (17U)
#define AON_GPADC_BIAS_SEL_LEN       (1U)
#define AON_GPADC_BIAS_SEL_MSK       (((1U << AON_GPADC_BIAS_SEL_LEN) - 1) << AON_GPADC_BIAS_SEL_POS)
#define AON_GPADC_BIAS_SEL_UMSK      (~(((1U << AON_GPADC_BIAS_SEL_LEN) - 1) << AON_GPADC_BIAS_SEL_POS))
#define AON_GPADC_TEST_EN            AON_GPADC_TEST_EN
#define AON_GPADC_TEST_EN_POS        (18U)
#define AON_GPADC_TEST_EN_LEN        (1U)
#define AON_GPADC_TEST_EN_MSK        (((1U << AON_GPADC_TEST_EN_LEN) - 1) << AON_GPADC_TEST_EN_POS)
#define AON_GPADC_TEST_EN_UMSK       (~(((1U << AON_GPADC_TEST_EN_LEN) - 1) << AON_GPADC_TEST_EN_POS))
#define AON_GPADC_TEST_SEL           AON_GPADC_TEST_SEL
#define AON_GPADC_TEST_SEL_POS       (19U)
#define AON_GPADC_TEST_SEL_LEN       (3U)
#define AON_GPADC_TEST_SEL_MSK       (((1U << AON_GPADC_TEST_SEL_LEN) - 1) << AON_GPADC_TEST_SEL_POS)
#define AON_GPADC_TEST_SEL_UMSK      (~(((1U << AON_GPADC_TEST_SEL_LEN) - 1) << AON_GPADC_TEST_SEL_POS))
#define AON_GPADC_PGA2_GAIN          AON_GPADC_PGA2_GAIN
#define AON_GPADC_PGA2_GAIN_POS      (22U)
#define AON_GPADC_PGA2_GAIN_LEN      (3U)
#define AON_GPADC_PGA2_GAIN_MSK      (((1U << AON_GPADC_PGA2_GAIN_LEN) - 1) << AON_GPADC_PGA2_GAIN_POS)
#define AON_GPADC_PGA2_GAIN_UMSK     (~(((1U << AON_GPADC_PGA2_GAIN_LEN) - 1) << AON_GPADC_PGA2_GAIN_POS))
#define AON_GPADC_PGA1_GAIN          AON_GPADC_PGA1_GAIN
#define AON_GPADC_PGA1_GAIN_POS      (25U)
#define AON_GPADC_PGA1_GAIN_LEN      (3U)
#define AON_GPADC_PGA1_GAIN_MSK      (((1U << AON_GPADC_PGA1_GAIN_LEN) - 1) << AON_GPADC_PGA1_GAIN_POS)
#define AON_GPADC_PGA1_GAIN_UMSK     (~(((1U << AON_GPADC_PGA1_GAIN_LEN) - 1) << AON_GPADC_PGA1_GAIN_POS))
#define AON_GPADC_DLY_SEL            AON_GPADC_DLY_SEL
#define AON_GPADC_DLY_SEL_POS        (28U)
#define AON_GPADC_DLY_SEL_LEN        (3U)
#define AON_GPADC_DLY_SEL_MSK        (((1U << AON_GPADC_DLY_SEL_LEN) - 1) << AON_GPADC_DLY_SEL_POS)
#define AON_GPADC_DLY_SEL_UMSK       (~(((1U << AON_GPADC_DLY_SEL_LEN) - 1) << AON_GPADC_DLY_SEL_POS))
#define AON_GPADC_TSVBE_LOW          AON_GPADC_TSVBE_LOW
#define AON_GPADC_TSVBE_LOW_POS      (31U)
#define AON_GPADC_TSVBE_LOW_LEN      (1U)
#define AON_GPADC_TSVBE_LOW_MSK      (((1U << AON_GPADC_TSVBE_LOW_LEN) - 1) << AON_GPADC_TSVBE_LOW_POS)
#define AON_GPADC_TSVBE_LOW_UMSK     (~(((1U << AON_GPADC_TSVBE_LOW_LEN) - 1) << AON_GPADC_TSVBE_LOW_POS))

/* 0x918 : adc converation sequence 1 */
#define AON_GPADC_REG_SCN_POS1_OFFSET (0x918)
#define AON_GPADC_SCAN_POS_0          AON_GPADC_SCAN_POS_0
#define AON_GPADC_SCAN_POS_0_POS      (0U)
#define AON_GPADC_SCAN_POS_0_LEN      (5U)
#define AON_GPADC_SCAN_POS_0_MSK      (((1U << AON_GPADC_SCAN_POS_0_LEN) - 1) << AON_GPADC_SCAN_POS_0_POS)
#define AON_GPADC_SCAN_POS_0_UMSK     (~(((1U << AON_GPADC_SCAN_POS_0_LEN) - 1) << AON_GPADC_SCAN_POS_0_POS))
#define AON_GPADC_SCAN_POS_1          AON_GPADC_SCAN_POS_1
#define AON_GPADC_SCAN_POS_1_POS      (5U)
#define AON_GPADC_SCAN_POS_1_LEN      (5U)
#define AON_GPADC_SCAN_POS_1_MSK      (((1U << AON_GPADC_SCAN_POS_1_LEN) - 1) << AON_GPADC_SCAN_POS_1_POS)
#define AON_GPADC_SCAN_POS_1_UMSK     (~(((1U << AON_GPADC_SCAN_POS_1_LEN) - 1) << AON_GPADC_SCAN_POS_1_POS))
#define AON_GPADC_SCAN_POS_2          AON_GPADC_SCAN_POS_2
#define AON_GPADC_SCAN_POS_2_POS      (10U)
#define AON_GPADC_SCAN_POS_2_LEN      (5U)
#define AON_GPADC_SCAN_POS_2_MSK      (((1U << AON_GPADC_SCAN_POS_2_LEN) - 1) << AON_GPADC_SCAN_POS_2_POS)
#define AON_GPADC_SCAN_POS_2_UMSK     (~(((1U << AON_GPADC_SCAN_POS_2_LEN) - 1) << AON_GPADC_SCAN_POS_2_POS))
#define AON_GPADC_SCAN_POS_3          AON_GPADC_SCAN_POS_3
#define AON_GPADC_SCAN_POS_3_POS      (15U)
#define AON_GPADC_SCAN_POS_3_LEN      (5U)
#define AON_GPADC_SCAN_POS_3_MSK      (((1U << AON_GPADC_SCAN_POS_3_LEN) - 1) << AON_GPADC_SCAN_POS_3_POS)
#define AON_GPADC_SCAN_POS_3_UMSK     (~(((1U << AON_GPADC_SCAN_POS_3_LEN) - 1) << AON_GPADC_SCAN_POS_3_POS))
#define AON_GPADC_SCAN_POS_4          AON_GPADC_SCAN_POS_4
#define AON_GPADC_SCAN_POS_4_POS      (20U)
#define AON_GPADC_SCAN_POS_4_LEN      (5U)
#define AON_GPADC_SCAN_POS_4_MSK      (((1U << AON_GPADC_SCAN_POS_4_LEN) - 1) << AON_GPADC_SCAN_POS_4_POS)
#define AON_GPADC_SCAN_POS_4_UMSK     (~(((1U << AON_GPADC_SCAN_POS_4_LEN) - 1) << AON_GPADC_SCAN_POS_4_POS))
#define AON_GPADC_SCAN_POS_5          AON_GPADC_SCAN_POS_5
#define AON_GPADC_SCAN_POS_5_POS      (25U)
#define AON_GPADC_SCAN_POS_5_LEN      (5U)
#define AON_GPADC_SCAN_POS_5_MSK      (((1U << AON_GPADC_SCAN_POS_5_LEN) - 1) << AON_GPADC_SCAN_POS_5_POS)
#define AON_GPADC_SCAN_POS_5_UMSK     (~(((1U << AON_GPADC_SCAN_POS_5_LEN) - 1) << AON_GPADC_SCAN_POS_5_POS))

/* 0x91C : adc converation sequence 2 */
#define AON_GPADC_REG_SCN_POS2_OFFSET (0x91C)
#define AON_GPADC_SCAN_POS_6          AON_GPADC_SCAN_POS_6
#define AON_GPADC_SCAN_POS_6_POS      (0U)
#define AON_GPADC_SCAN_POS_6_LEN      (5U)
#define AON_GPADC_SCAN_POS_6_MSK      (((1U << AON_GPADC_SCAN_POS_6_LEN) - 1) << AON_GPADC_SCAN_POS_6_POS)
#define AON_GPADC_SCAN_POS_6_UMSK     (~(((1U << AON_GPADC_SCAN_POS_6_LEN) - 1) << AON_GPADC_SCAN_POS_6_POS))
#define AON_GPADC_SCAN_POS_7          AON_GPADC_SCAN_POS_7
#define AON_GPADC_SCAN_POS_7_POS      (5U)
#define AON_GPADC_SCAN_POS_7_LEN      (5U)
#define AON_GPADC_SCAN_POS_7_MSK      (((1U << AON_GPADC_SCAN_POS_7_LEN) - 1) << AON_GPADC_SCAN_POS_7_POS)
#define AON_GPADC_SCAN_POS_7_UMSK     (~(((1U << AON_GPADC_SCAN_POS_7_LEN) - 1) << AON_GPADC_SCAN_POS_7_POS))
#define AON_GPADC_SCAN_POS_8          AON_GPADC_SCAN_POS_8
#define AON_GPADC_SCAN_POS_8_POS      (10U)
#define AON_GPADC_SCAN_POS_8_LEN      (5U)
#define AON_GPADC_SCAN_POS_8_MSK      (((1U << AON_GPADC_SCAN_POS_8_LEN) - 1) << AON_GPADC_SCAN_POS_8_POS)
#define AON_GPADC_SCAN_POS_8_UMSK     (~(((1U << AON_GPADC_SCAN_POS_8_LEN) - 1) << AON_GPADC_SCAN_POS_8_POS))
#define AON_GPADC_SCAN_POS_9          AON_GPADC_SCAN_POS_9
#define AON_GPADC_SCAN_POS_9_POS      (15U)
#define AON_GPADC_SCAN_POS_9_LEN      (5U)
#define AON_GPADC_SCAN_POS_9_MSK      (((1U << AON_GPADC_SCAN_POS_9_LEN) - 1) << AON_GPADC_SCAN_POS_9_POS)
#define AON_GPADC_SCAN_POS_9_UMSK     (~(((1U << AON_GPADC_SCAN_POS_9_LEN) - 1) << AON_GPADC_SCAN_POS_9_POS))
#define AON_GPADC_SCAN_POS_10         AON_GPADC_SCAN_POS_10
#define AON_GPADC_SCAN_POS_10_POS     (20U)
#define AON_GPADC_SCAN_POS_10_LEN     (5U)
#define AON_GPADC_SCAN_POS_10_MSK     (((1U << AON_GPADC_SCAN_POS_10_LEN) - 1) << AON_GPADC_SCAN_POS_10_POS)
#define AON_GPADC_SCAN_POS_10_UMSK    (~(((1U << AON_GPADC_SCAN_POS_10_LEN) - 1) << AON_GPADC_SCAN_POS_10_POS))
#define AON_GPADC_SCAN_POS_11         AON_GPADC_SCAN_POS_11
#define AON_GPADC_SCAN_POS_11_POS     (25U)
#define AON_GPADC_SCAN_POS_11_LEN     (5U)
#define AON_GPADC_SCAN_POS_11_MSK     (((1U << AON_GPADC_SCAN_POS_11_LEN) - 1) << AON_GPADC_SCAN_POS_11_POS)
#define AON_GPADC_SCAN_POS_11_UMSK    (~(((1U << AON_GPADC_SCAN_POS_11_LEN) - 1) << AON_GPADC_SCAN_POS_11_POS))

